ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
/* misc */
uint16_t diagCancels               = 0;
#endif
/////////////////////////////////////////////////////////////////////////////////

/*************************************************************************************************/
/*!
 *  \brief      Configure GPIO as input or output.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioCfgOutput(uint32_t pin)
{
  nrf_gpio_cfg_output(pin);
}

/*************************************************************************************************/
/*!
 *  \brief      Set GPIO pin high.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioSet(uint32_t pin)
{
  nrf_gpio_pin_write(pin, 1);
}

/*************************************************************************************************/
/*!
 *  \brief      Set GPIO pin low.
 *
 *  \param      pin           Pin number.
 */
/*************************************************************************************************/
void PalBbGpioClear(uint32_t pin)
{
  nrf_gpio_pin_write(pin, 0);
}

/*************************************************************************************************/
/*!
 *  \brief      Toggle GPIO.
 *
 *  \param      pin           Pin number.
 *  \param      times         GPIO toggle times.
 */
/*************************************************************************************************/
void PalBbGpioToggle(uint32_t pin, uint32_t times)
{
  for (uint32_t i = 0; i < times; i++)
  {
    nrf_gpio_pin_write(pin, 1);
    nrf_gpio_pin_write(pin, 0);
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Set radio mode.
 *
 *  \param      phy     PHY.
 *  \param      option  PHY option.
 */
/*************************************************************************************************/
static inline void palBbSetRadioMode(uint8_t phy, uint8_t option)
{
  switch(phy)
  {
    case BB_PHY_BLE_1M:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_1Mbit;
      break;

#if defined(NRF52832_XXAA) || defined(NRF52840_XXAA)
    case BB_PHY_BLE_2M:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_2Mbit;
      break;
#endif

#if defined(NRF52840_XXAA)
    case BB_PHY_BLE_CODED:
      if (option == BB_PHY_OPTIONS_BLE_S2)
      {
        NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_LR500Kbit;
      }
      else
      {
        NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_LR125Kbit;
      }
    break;
#endif

    default:
      NRF_RADIO->MODE = RADIO_MODE_MODE_Ble_1Mbit;
      break;
  }

  /* select LED according to client selection not actual PHY used */
  switch (bbRxPhy)
  {
    case BB_PHY_BLE_1M:
      BB_LED_1M_ON();
      break;
    case BB_PHY_BLE_2M:
      BB_LED_2M_ON();
      break;
    case BB_PHY_BLE_CODED:
      BB_LED_CODED_ON();
      break;
    default:
      break;
  }

#if defined(NRF52832_XXAA)
  *(volatile uint32_t*)0x40001777 = 0UL;   /* Disable fault tolerant AA correlator. */
#endif
}

#if (USE_RTC_BB_CLK)
/*************************************************************************************************/
/*!
 *  \brief      Set the time for the PAL_BB_TIMER to start.
 *
 *  \param      startTime     PAL_BB_TIMER start time.
 *
 */
/*************************************************************************************************/
static void palBbStartTimer(uint32_t startTime)
{
  bbEventStartTime = PAL_BB_RTC->CC[1] = startTime;
  PAL_BB_RTC->EVENTS_COMPARE[1] = 0;
  WAIT_FOR_WR_BUF_EMPTY(PAL_BB_RTC->EVENTS_COMPARE[1]);
}
#endif

/*************************************************************************************************/
/*!
 *  \brief      Low power operation.
 *
 *  \note       Called by upper baseband code.
 */
/*************************************************************************************************/
void PalBbBleLowPower(void)
{
  /* Stop high frequency timer between BLE events if low lower mode. */
#if (USE_RTC_BB_CLK)
  PAL_BB_TIMER->TASKS_STOP = 1;
  PAL_BB_TIMER->TASKS_CLEAR = 1;
#endif
}

#if (BB_ENABLE_INLINE_ENC_TX)
/*************************************************************************************************/
/*!
 *  \brief      Enable or disable inline encryption on transmit.
 *
 *  \param      enable  Boolean flag to enable or disable TX encryption
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptTxEnable(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* copy encryption enable to global variable */
  bbEncryptTxFlag = enable;
}
#endif

#if (BB_ENABLE_INLINE_DEC_RX)
/*************************************************************************************************/
/*!
 *  \brief      Enable or disable inline decryption on reception.
 *
 *  \param      enable  Boolean flag to enable or disable RX decryption
 */
/*************************************************************************************************/
static void palBbBleInlineDecryptRxEnable(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* copy decryption enable to global variable */
  bbDecryptRxFlag = enable;
}
#endif

#if (BB_ENABLE_INLINE_ENC_TX || BB_ENABLE_INLINE_DEC_RX)
/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption MIC suppression.
 *
 *  \param      enable  Boolean flag to indicate if MIC is suppressed
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptDecryptSuppressMic(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* copy to global variable */
  bbEncryptTxSuppressMic = enable;
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption key.
 *
 *  \param      key     Pointer to 16-byte key value
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptDecryptSetKey(uint8_t *pKey)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

