ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  #if BB_ENABLE_ASSERT == TRUE
  keySetFlag = 1;
  #endif

  /* populate encryption structure with reversed stored key */
  for (unsigned int i=0; i<16; i++)
  {
    bbEncryptCcmData[i] = pKey[15-i];
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption IV (initialization vector).
 *
 *  \param      key     Pointer to 8-byte value for IV
 */
/*************************************************************************************************/
static void palBbBleDrvInlineEncryptDecryptSetIv(uint8_t *pIV)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ENABLE_ASSERT == TRUE
  ivSetFlag = 1;
  #endif

  /* populate encryption structure with reversed stored IV */
  memcpy(&bbEncryptCcmData[25], pIV, 8);
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption type.
 *
 *  \param      encType     0=PAL_BB_TYPE_ACL, CIS, BIS
 */
/*************************************************************************************************/
static void palBbBleInlineEncryptSetType(uint8_t encType)
{
  #if BB_ENABLE_ASSERT == TRUE
  encryptTypeSetFlag = 1;
  #endif

  bbEncryptType = encType;
}

/*************************************************************************************************/
/*!
 *  \brief      Set inline encryption/decryption direction bit.
 *
 *  \param      dir     0=slave, non-zero=master
 */
/*************************************************************************************************/
void palBbBleInlineEncryptDecryptSetDirection(uint8_t dir)
{
  #if BB_ENABLE_ASSERT == TRUE
  directionSetFlag = 1;
  #endif

  bbEncryptDirection = dir;
}

/*************************************************************************************************/
/*!
 *  \brief      Set the inline encryption packet count for transmit.
 *
 *  \param      pktCtr  Packet counter value, a 39-bit value (upper bits are ignored).
 */
/*************************************************************************************************/
void PalBbBleSetInlineEncryptPacketCount(uint64_t pktCtr)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ENABLE_ASSERT == TRUE
  txPacketCountSetFlag = 1;
  #endif

  /* populate packet counter */
  bbEncryptPacketCounter = pktCtr;
}

/*************************************************************************************************/
/*!
 *  \brief      Set the inline decryption packet count for receive.
 *
 *  \param      pktCtr  Packet counter value, a 39-bit value (upper bits are ignored).
 */
/*************************************************************************************************/
void PalBbBleSetInlineDecryptPacketCount(uint64_t pktCtr)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  #if BB_ENABLE_ASSERT == TRUE
  rxPacketCountSetFlag = 1;
  #endif

  /* populate packet counter */
  bbDecryptPacketCounter = pktCtr;
}
#endif

/*************************************************************************************************/
/*!
 *  \brief      Initialize the BLE baseband driver.
 *
 *  One-time initialization of BLE baseband driver.
 */
/*************************************************************************************************/
void PalBbBleInit(void)
{
  BB_ASSERT( LL_AA_LEN == (NORDIC_PREFIX_LEN + NORDIC_BASE_ADDR_LEN) ); /* internal integrity check */
  BB_ASSERT(driverState == NULL_STATE); /* driver should only be initialized once */

  /* initialize callback routines to NULL */
  bbTxCallback = NULL;
  bbRxCallback = NULL;

  /* give timeout an initial value, used by assert */
  bbRxTimeoutUsec = 0;

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
  NRF_RADIO->MODECNF0 = RADIO_MODECNF0_RU_Fast << RADIO_MODECNF0_RU_Pos;
#endif

#if defined(NRF51)
  /* if available, copy in the factory radio calibration values  */
  if ((NRF_FICR->OVERRIDEEN & FICR_OVERRIDEEN_BLE_1MBIT_Msk) == 0)
  {
    NRF_RADIO->OVERRIDE0 =  NRF_FICR->BLE_1MBIT[0];
    NRF_RADIO->OVERRIDE1 =  NRF_FICR->BLE_1MBIT[1];
    NRF_RADIO->OVERRIDE2 =  NRF_FICR->BLE_1MBIT[2];
    NRF_RADIO->OVERRIDE3 =  NRF_FICR->BLE_1MBIT[3];
    NRF_RADIO->OVERRIDE4 =  NRF_FICR->BLE_1MBIT[4] | RADIO_OVERRIDE4_ENABLE_Msk;
  }
#endif

  /* CRC configuration */
  NRF_RADIO->CRCCNF  = LL_CRC_LEN | RADIO_CRCCNF_SKIP_ADDR_Msk;  /* set length, skip address as part of CRC */
  NRF_RADIO->CRCPOLY = 0x0000065B;  /* crc polynomial, value from bluetooth spec */

  /* set logical address 0 for transmit (uses PREFIX0.AP0/BASE0 pair) */
  NRF_RADIO->TXADDRESS = 0;

  /* enable receive address on logical address 0 (uses PREFIX0.AP0/BASE0 pair) */
  NRF_RADIO->RXADDRESSES = 1;  /* NOTE: this is a bitmask, a '1' enables logical address 0 */

  /* set default direction in CCM structure */
  bbEncryptCcmData[24] = 0;  /* 0=slave, 1=master */

  /* set default value for data whitening */
  bbRadioPcnf1WhiteEn = RADIO_PCNF1_WHITEEN_Enabled;

  /* set initial value for TIFS adjustment */
  bbTxTifsAdj = 0;

  /* set default of no encryption */
  bbEncryptTxFlag = 0;
  bbDecryptRxFlag = 0;

#if (USE_RTC_BB_CLK)
  PAL_BB_RTC->EVTENCLR = RTC_EVTENCLR_COMPARE1_Msk;
  PAL_BB_RTC->EVTENCLR = RTC_EVTENCLR_COMPARE2_Msk;
#endif

  /* update driver state */
  driverState = SLEEP_STATE;

  /////////////////////////////////////////////////////////////////////////////////
  #if BB_ENABLE_ASSERT
  /* initialize buffers with 0xAA's, last two bytes used by assert to detect buffer overrun */
  memset(bbEncryptPlainBuf,     0xAA, sizeof(bbEncryptPlainBuf));
  memset(bbEncryptEncryptedBuf, 0xAA, sizeof(bbEncryptEncryptedBuf));
  memset(bbEncryptScratchBuf,   0xAA, sizeof(bbEncryptScratchBuf));
  #endif
  /////////////////////////////////////////////////////////////////////////////////

  bbTxPhyOptions = BB_PHY_OPTIONS_DEFAULT;
  bbRxPhyOptions = BB_PHY_OPTIONS_DEFAULT;
  tifsTxPhyOptions = BB_PHY_OPTIONS_DEFAULT;

  PalBbRegisterProtIrq(BB_PROT_BLE, BbBleDrvTimerIRQHandler, BbBleDrvRadioIRQHandler);
  PalBbRegisterProtIrq(BB_PROT_BLE_DTM, BbBleDrvTimerIRQHandler, BbBleDrvRadioIRQHandler);
}

/*************************************************************************************************/
/*!
 *  \brief      Enable the BB hardware.
 *
 *  Wake the BB hardware out of sleep and enable for operation. All BB functionality is
 *  available when this routine completes. BB clock is set to zero and started.
 */
/*************************************************************************************************/
void PalBbBleEnable(void)
{
  /* Give the BB the highest priority. */
  NVIC_SetPriority(RADIO_IRQn, 1);
  NVIC_SetPriority(PAL_BB_IRQn, 1);

  BB_ASSERT(NVIC_GetPriority(RADIO_IRQn) == NVIC_GetPriority(PAL_BB_IRQn)); /* BB driver related interrupts must have same priority */
  BB_ASSERT(driverState == SLEEP_STATE); /* the BB driver should never be re-enabled */
  BB_ASSERT(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_STATE_Msk); /* HF clock must be running */
#if (USE_RTC_BB_CLK)
  if (!(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_SRC_Msk))
  {
    NRF_CLOCK->TASKS_HFCLKSTART = 1;
  }

#else
  BB_ASSERT(NRF_CLOCK->HFCLKSTAT & CLOCK_HFCLKSTAT_SRC_Msk);   /* HF clock source must be the crystal */
#endif

