ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* stop timer if it was somehow running (timer must be stopped for configuration) */
  PAL_BB_TIMER->TASKS_STOP  = 1;

  /* clear timer to zero count */
  PAL_BB_TIMER->TASKS_CLEAR = 1;

  /* configure timer */
  PAL_BB_TIMER->MODE      = TIMER_MODE_MODE_Timer;
  PAL_BB_TIMER->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;
  PAL_BB_TIMER->PRESCALER = TIMER_PRESCALER;  /* f = 16MHz / (2 ^ TIMER_PRESCALER),  for TIMER_PRESCALER of 4, clock has 1us resolution
                                                                                       TIMER_PRESCALER of 3, clock is 0.5us resolution
                                                                                       TIMER_PRESCALER of 2, clock is 0.25us resolution
                                                                                       TIMER_PRESCALER of 1, clock is 0.125us resolution  */

  /*
   *   Configure the PPI Channel 13 -  "Chan 13: RTC.COMPARE[0] -> TIMER[3].START"
   *
   *   This channel is used to trigger starting TIMER[3] for radio operations.
   */
#if (USE_RTC_BB_CLK)
  /* TIMER0 starts when RTC0.COMPARE[1] event is triggered */
  NRF_PPI->CH[13].EEP = (uint32_t) &PAL_BB_RTC->EVENTS_COMPARE[1];
  NRF_PPI->CH[13].TEP = (uint32_t) &PAL_BB_TIMER->TASKS_START;
  NRF_PPI->CHENSET = PPI_CHENSET_CH13_Msk;                                        /* enable channel */

  /* HFCLK starts when RTC0.COMPARE[2] event is triggered */
  NRF_PPI->CH[10].EEP = (uint32_t) &PAL_BB_RTC->EVENTS_COMPARE[2];
  NRF_PPI->CH[10].TEP = (uint32_t) &NRF_CLOCK->TASKS_HFCLKSTART;
  NRF_PPI->CHENSET = PPI_CHENSET_CH10_Msk;                                        /* enable channel */
#else
  /* TIMER0 is a free running clock */
  PAL_BB_TIMER->TASKS_START = 1;
#endif

  /*
   *   Configure the PPI Channel 14 -  "Chan 14: TIMER[3].COMPARE[0] -> TXEN/RXEN"
   *
   *   This channel is used to trigger radio task TXEN, or RXEN, on timer event COMPARE[0].
   *   It is only enabled when needed. The PPI task parameter is meant to be configured just
   *   before the channel is enabled. This task will be either TXEN or RXEN depending on radio
   *   operation. The event is static and never changes. It is configured below.
   */
  NRF_PPI->CH[14].EEP = (uint32_t) &PAL_BB_TIMER->EVENTS_COMPARE[0];   /* configure event */

  /*
   *   Configure and enable PPI Channel 15 -  "Chan 15: PAYLOAD -> CAPTURE[2]"
   *
   *   This channel is used to capture the timer value on every radio PAYLOAD event.
   *   It is configured to trigger timer task CAPTURE[2] which copies the timer to CC[2].
   *
   *   Once this channel is set up and enabled, it requires no further action.
   *   It will stay active until the BB driver is disabled.
   */
  NRF_PPI->CH[15].EEP = (uint32_t) &NRF_RADIO->EVENTS_PAYLOAD;        /* configure event */
  NRF_PPI->CH[15].TEP = (uint32_t) &PAL_BB_TIMER->TASKS_CAPTURE[2];     /* configure task */
  NRF_PPI->CHENSET = PPI_CHENSET_CH15_Msk;                            /* enable channel */

  /*
   *   Configure and enable PPI Channel 16 -  "Chan 16: ADDRESS -> CAPTURE[4]"
   *
   *   This channel is used to capture the timer value on every radio ADDRESS event.
   *   It is configured to trigger timer task CAPTURE[4] which copies the timer to CC[4].
   *
   *   Once this channel is set up and enabled, it requires no further action.
   *   It will stay active until the BB driver is disabled.
   */
  NRF_PPI->CH[16].EEP = (uint32_t) &NRF_RADIO->EVENTS_ADDRESS;        /* configure event */
  NRF_PPI->CH[16].TEP = (uint32_t) &PAL_BB_TIMER->TASKS_CAPTURE[4];     /* configure task */
  NRF_PPI->CHENSET = PPI_CHENSET_CH16_Msk;                            /* enable channel */

  /*
   *   NOTE: Per Nordic support team response, PPI channels do not require a reset.
   *         The PPI configured event will trigger the configured task every time it happens,
   *         regardless if the EVENT register is cleared or not.  (This is not clear from the
   *         reference manual.)
   */

  /* clear out and enable BB scheduler interrupts at system level */
  PAL_BB_TIMER->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(PAL_BB_IRQn);
  NVIC_EnableIRQ(PAL_BB_IRQn);

  /* clear out and enable RADIO interrupts at system level */
  NRF_RADIO->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(RADIO_IRQn);
  NVIC_EnableIRQ(RADIO_IRQn);

  /* clear out and enable CCM/AAR interrupts at system level */
  NRF_CCM->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(CCM_AAR_IRQn);
  NVIC_EnableIRQ(CCM_AAR_IRQn);

   /*
    *  Enable all the radio interrupts that are used. Per design, these are to
    *  be left on as long as the BB driver is enabled.
    */

#if (USE_RTC_BB_CLK)
  PAL_BB_RTC->EVTENSET = RTC_EVTENSET_COMPARE1_Msk;
  PAL_BB_RTC->EVTENSET = RTC_EVTENSET_COMPARE2_Msk;
#endif

  /* enable the radio "TIFS Expired" interrupt (triggers on radio PAYLOAD event) */
  NRF_RADIO->EVENTS_READY = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_READY);
  NRF_RADIO->INTENSET = RADIO_INTENSET_READY_Msk;

  /* enable the radio "Timestamp/TIFS Setup" interrupt (triggers on radio PAYLOAD event) */
  NRF_RADIO->EVENTS_PAYLOAD = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_PAYLOAD);
  NRF_RADIO->INTENSET = RADIO_INTENSET_PAYLOAD_Msk;

  /* enable the radio "TX-RX Complete" interrupt (triggers on radio END event) */
  NRF_RADIO->EVENTS_DISABLED = 0;
  NRF_RADIO->EVENTS_END = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_END);
  NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk;

  /* put the radio is a definite know state */
  palBbRadioHardStop();
}

/*************************************************************************************************/
/*!
 *  \brief      Disable the BB hardware.
 *
 *  Disable the baseband and put radio hardware to sleep. Must be called from an idle state.
 *  A radio operation cannot be in progress.
 */
/*************************************************************************************************/
void PalBbBleDisable(void)
{
  BB_ASSERT(driverState == IDLE_STATE); /* can only disable if radio is idle */

