ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* slight chance that a TIFS operation is ramping up, this will stop it */
  palBbRadioHardStop();

  /* stop timer */
  PalBbBleLowPower();

  /* disable PPI channels */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;   /* Chan 14: COMPARE[0] -> TXEN/RXEN */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH15_Msk;   /* Chan 15: PAYLOAD -> CAPTURE[2] */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH16_Msk;   /* Chan 16: ADDRESS -> CAPTURE[4] */

#if (USE_RTC_BB_CLK)
  PAL_BB_RTC->EVTENCLR = RTC_EVTENCLR_COMPARE1_Msk;
  PAL_BB_RTC->EVTENCLR = RTC_EVTENCLR_COMPARE2_Msk;
#endif

  /* disable and clean up TIMER0 interrupts */
  NVIC_DisableIRQ(PAL_BB_IRQn);
  PAL_BB_TIMER->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(PAL_BB_IRQn);

  /* disable and clean up RADIO interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);
  NRF_RADIO->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* disable and clean up CCM/AAR interrupts */
  NVIC_DisableIRQ(CCM_AAR_IRQn);
  NRF_CCM->INTENCLR = 0xFFFFFFFF;
  NVIC_ClearPendingIRQ(CCM_AAR_IRQn);

  /* update driver state */
  driverState = SLEEP_STATE;
}

/*************************************************************************************************/
/*!
 *  \brief      Set the packet transmit completion handler.
 *
 *  \param      pParam     Callback called upon the completion of a transmit operation.
 *
 *  The given \a txCback routine is called once and only once in response to \a BbDrvTx(). It
 *  should be called in the ISR context due to the transmit completion interrupt from the BB.
 *  If \a BbDrvTxCancel() is called with a return value of TRUE, \a txCback must not be executed.
 */
/*************************************************************************************************/
void PalBbBleSetDataParams(const PalBbBleDataParam_t *pParam)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */
  BB_ASSERT(pParam->txCback != NULL); /* must be set to something */
  BB_ASSERT(pParam->rxCback != NULL); /* must be set to something */

  /* store the callback function addresses to local memory */
  bbTxCallback = pParam->txCback;
  bbRxCallback = pParam->rxCback;

  /* store due time for future use */
  bbAntennaDueTimeUsec = pParam->dueUsec;

  /* store timeout value for future use */
  bbRxTimeoutUsec = pParam->rxTimeoutUsec;

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  bbTxCallback = DiagFauxTxCallback;
  diagTxCallback = pParam->txCback;
  bbRxCallback = DiagFauxRxCallback;
  diagRxCallback = pParam->rxCback;
  #endif
  /* for diagnostic purposes, an override scheme where all callbacks pass through an internal path. */
  /////////////////////////////////////////////////////////////////////////////////
}

/*************************************************************************************************/
/*!
 *  \brief      Set the operation parameters.
 *
 *  \param      pOpParam    Operations parameters.
 *
 *  Calling this routine will set parameters for the next transmit or receive operations.
 */
/*************************************************************************************************/
void PalBbBleSetOpParams(const PalBbBleOpParam_t *pOpParam)
{
  bbOpParam = *pOpParam;
}

/*************************************************************************************************/
/*!
 *  \brief      Set channelization parameters.
 *
 *  \param      pChan      Channelization parameters.
 */
/*************************************************************************************************/
static void palBbBleSetChannelParam(PalBbBleChan_t *pChan)
{
  uint8_t rfChan;
  int8_t  txPower;

  /* get the channel index into a local variable, for efficiency */
  bbChanIndex = pChan->chanIdx;

  /* save the PHYs */
  bbTxPhy = pChan->txPhy;
  bbRxPhy = pChan->rxPhy;
  bbTxPhyOptions = pChan->initTxPhyOptions;
  tifsTxPhyOptions = pChan->tifsTxPhyOptions;

  BB_ASSERT((pChan->txPhy == BB_PHY_BLE_1M) ||
            (pChan->txPhy == BB_PHY_BLE_2M) ||
            (pChan->txPhy == BB_PHY_BLE_CODED));
  BB_ASSERT((pChan->rxPhy == BB_PHY_BLE_1M) ||
            (pChan->rxPhy == BB_PHY_BLE_2M) ||
            (pChan->rxPhy == BB_PHY_BLE_CODED));

  /* convert channel index to RF channel, per bluetooth specification */
  rfChan = 0; /* initialize to zero to suppress compiler 'uninitialized' warning */
  if (bbChanIndex <= 10)        {  rfChan = bbChanIndex + 1;  }
  else if (bbChanIndex <= 36)   {  rfChan = bbChanIndex + 2;  }
  else if (bbChanIndex == 37)   {  rfChan = 0;   }
  else if (bbChanIndex == 38)   {  rfChan = 12;  }
  else if (bbChanIndex == 39)   {  rfChan = 39;  }
  else
  {
    BB_ASSERT(0); /* illegal channel index */
  }

  /* set the radio frequency */
  NRF_RADIO->FREQUENCY = 2 + (rfChan * 2);  /* over-the-air freq = 2400Hz + value in FREQUENCY */

  /* set the data whitening initial value, based on channel index per bluetooth spec */
  NRF_RADIO->DATAWHITEIV = bbChanIndex | 0x40;  /* position zero is always '1', it gets "or'ed" in here with 0x40 */

  /* set access addresses for logical address 0, which uses the PREFIX0.AP0/BASE0 pair */
  NRF_RADIO->PREFIX0 = (pChan->accAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (pChan->accAddr & 0x00FFFFFF) <<  8;

#if (LL_ENABLE_TESTER == TRUE)
  /* store access address overrides */
  bbRxAccAddr = pChan->accAddrRx;
  bbTxAccAddr = pChan->accAddrTx;
#endif

  /* set initial CRC */
  NRF_RADIO->CRCINIT = pChan->crcInit;

#if (LL_ENABLE_TESTER == TRUE)
  /* store CRC init overrides */
  bbRxCrcInit = pChan->crcInitRx;
  bbTxCrcInit = pChan->crcInitTx;
#endif

  /* get the transmit power into a local variable, for efficiency */
  txPower = pChan->txPower;

#if defined(NRF52840_XXAA)
  if      (txPower >=   8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos8dBm;   txPower =   8;  }
  else if (txPower >=   7)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos7dBm;   txPower =   7;  }
  else if (txPower >=   6)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos6dBm;   txPower =   6;  }
  else if (txPower >=   5)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos5dBm;   txPower =   5;  }
  else if (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   3)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos3dBm;   txPower =   3;  }
  else if (txPower >=   2)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos2dBm;   txPower =   2;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg40dBm;  txPower = -40;  }
#elif defined(NRF52832_XXAA)
  if      (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   3)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos3dBm;   txPower =   3;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg40dBm;  txPower = -40;  }
#else
  if      (txPower >=   4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;   txPower =   4;  }
  else if (txPower >=   0)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_0dBm;      txPower =   0;  }
  else if (txPower >=  -4)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg4dBm;   txPower =  -4;  }
  else if (txPower >=  -8)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg8dBm;   txPower =  -8;  }
  else if (txPower >= -12)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg12dBm;  txPower = -12;  }
  else if (txPower >= -16)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg16dBm;  txPower = -16;  }
  else if (txPower >= -20)  {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg20dBm;  txPower = -20;  }
  else                      {  NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Neg30dBm;  txPower = -30;  }
#endif

  /* set the power parameter to the value that was actually set in hardware */
  pChan->txPower = txPower;

#if BB_ENABLE_INLINE_ENC_TX
  /* enable inline encryption */
  palBbBleInlineEncryptTxEnable(pChan->enc.enaEncrypt);
#endif

#if BB_ENABLE_INLINE_DEC_RX
  /* enable inline decryption */
  palBbBleInlineDecryptRxEnable(pChan->enc.enaDecrypt);
#endif

#if (BB_ENABLE_INLINE_ENC_TX || BB_ENABLE_INLINE_DEC_RX)
  /* set encryption parameters */
  if (pChan->enc.enaEncrypt || pChan->enc.enaDecrypt)
  {
    palBbBleInlineEncryptDecryptSuppressMic(FALSE); /* TODO add MIC suppression */
    palBbBleInlineEncryptDecryptSetKey(pChan->enc.sk);
    palBbBleDrvInlineEncryptDecryptSetIv(pChan->enc.iv);
    palBbBleInlineEncryptSetType(pChan->enc.type);
    palBbBleInlineEncryptDecryptSetDirection(pChan->enc.dir);
  }
#endif
}

/*************************************************************************************************/
/*!
 *  \brief      Set channelization parameters.
 *
 *  \param      pChan      Channelization parameters.
 *
 *  Calling this routine will set these parameters for all future transmit and receive operations
 *  until this routine is called again providing new parameters.
 *
 *  The setting of channelization parameters influence the operations of the following listed
 *  routines. Therefore, this routine is called to set the channel characteristics before
 *  the use of these listed packet routines.
 *
 *  - \a BbDrvTx()
 *  - \a BbDrvRx()
 *  - \a BbDrvTxTifs()
 *  - \a BbDrvRxTifs()
 *
 *  \note       The \a pParam contents are not guaranteed to be static and is only valid in the
 *              context of the call to this routine. Therefore parameters requiring persistence
 *              should be copied.
 */
/*************************************************************************************************/
void PalBbBleSetChannelParam(PalBbBleChan_t *pChan)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* stop any TIFS operation that might be ramping up */
  palBbRadioHardStop();

  palBbBleSetChannelParam(pChan);
}

/*************************************************************************************************/
/*!
 *  \brief      Enable or disable data whitening.
 *
 *  \param      enable       flag to indicate data whitening
 *
 *  Sets an internal variable that indicates if data whitening is enabled or not.
 *  The value is used later when setting PCNF1 at beginning of TX or RX.
 */
/*************************************************************************************************/
void PalBbBleEnableDataWhitening(bool_t enable)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */

  /* assume disabled */
  bbRadioPcnf1WhiteEn = RADIO_PCNF1_WHITEEN_Disabled;

