ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* if enabled set accordingly */
  if (enable)
  {
    bbRadioPcnf1WhiteEn = RADIO_PCNF1_WHITEEN_Enabled;
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Enable or disable PRBS15.
 *
 *  \param      enable       flag to indicate PRBS15
 *
 *  Immediately enable or disable continuous PRBS15 bitstream.
 */
/*************************************************************************************************/
void PalBbBleEnablePrbs15(bool_t enable)
{
  if (enable)
  {
    BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle to enter this mode */

    /* stop the radio in case a TIFS is ramping up */
    palBbRadioHardStop();

    /* set test mode */
#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
    palBbSetRadioMode(BB_PHY_BLE_1M, BB_PHY_OPTIONS_DEFAULT);
    NRF_RADIO->MODECNF0 = RADIO_MODECNF0_DTX_Center << RADIO_MODECNF0_DTX_Pos;
#else
    palBbSetRadioMode(BB_PHY_BLE_1M, BB_PHY_OPTIONS_DEFAULT);
    NRF_RADIO->TEST = (RADIO_TEST_CONST_CARRIER_Enabled << RADIO_TEST_CONST_CARRIER_Pos) |
                      (RADIO_TEST_PLL_LOCK_Enabled      << RADIO_TEST_PLL_LOCK_Pos);
#endif

    /* start transmitting constant carrier */
    NRF_RADIO->TASKS_TXEN = 1;

    /* update the driver state */
    driverState = PRBS15_STATE;
  }
  else
  {
    BB_ASSERT(driverState == PRBS15_STATE); /* not in test mode, cannot disable */

#if defined(NRF52840_XXAA) || defined(NRF52832_XXAA)
    NRF_RADIO->MODECNF0 = 0;
#else
    /* disable test mode */
    NRF_RADIO->TEST = 0;

    /* stop the radio */
    palBbRadioHardStop();
#endif

    /* update the driver state */
    driverState = IDLE_STATE;
    BB_LED_OFF();
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Transmit a packet.
 *
 *  \param      descs       Array of transmit buffer descriptor.
 *  \param      cnt         Number of descriptors.
 */
/*************************************************************************************************/
void PalBbBleTxData(PalBbBleTxBufDesc_t descs[], uint8_t cnt)
{
  uint8_t *pBuf = palBbGetTxData(descs, cnt);

#if defined(BOARD_PCA10056)
  /*
   *   Observed frequent failures with consecutive coded phy TX's.
   *   In the case, radio stays in TXDISABLE(temporary transition state) for too long.
   *   Calling palBbRadioHardStop multiple times seems to settle radio state into idle(Disabled) state.
   */
  if (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled)
  {
    uint8_t num_cleanup = 0;
    uint8_t busycount;

    while (num_cleanup < 3)
    {
      palBbRadioHardStop();

      busycount = 0;
      while ((NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled) && (busycount < 10))
      {
        busycount++;
      }

      if (busycount < 10)
      {
        /* Radio state is cleared now, continue TxData operation. */
        break;
      }

      if (++num_cleanup == 3)
      {
        palBbRestoreTrl();
        bbTxCallback(BB_STATUS_FAILED);
        return;
      }
    }
  }
#else
  palBbRadioHardStop();
#endif

  BB_ASSERT(driverState == IDLE_STATE);                       /* driver must be idle */
  BB_ASSERT(bbTxCallback != NULL);                            /* callback must be configured */
  BB_ALIGN_ASSERT(pBuf);

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  BB_ASSERT(diagOp == DIAG_NULL); /* apparently previous operation did not complete */
  diagOp = DIAG_TX;
  diagTxTotalCalls++;
  diagTxCalls++;
  #endif
  /////////////////////////////////////////////////////////////////////////////////

#if (LL_ENABLE_TESTER == TRUE)
  /* set Tx access addresses */
  NRF_RADIO->PREFIX0 = (bbTxAccAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (bbTxAccAddr & 0x00FFFFFF) <<  8;
  if (invalidateAccAddrOnceTx)
  {
    invalidateAccAddrOnceTx = FALSE;

    /* invalidate */
    NRF_RADIO->PREFIX0 = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
    NRF_RADIO->BASE0   = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
  }

  uint16_t hdr;
  BYTES_TO_UINT16(hdr, pBuf);

  if ((hdr & bbModifyTxHdrMask) == bbModifyTxHdrValue)
  {
    if (bbTxAccAddrInvalidChanMask & (UINT64_C(1) << bbChanIndex))
    {
      if ((bbTxAccAddrInvalidAdjMask & (1 << bbTxAccAddrInvalidStep)) || bbTxAccAddrShiftMask)
      {
        if (bbTxAccAddrShiftMask)
        {
          uint32_t invalidAA = (1 << bbTxAccAddrInvalidStep) ^ bbTxAccAddr;

          NRF_RADIO->PREFIX0 = (invalidAA & 0xFF000000) >> 24;
          NRF_RADIO->BASE0   = (invalidAA & 0x00FFFFFF) <<  8;
        }
        else
        {
          /* invalidate */
          NRF_RADIO->PREFIX0 = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
          NRF_RADIO->BASE0   = ((bbTxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
        }
      }

      if (!bbTxAccAddrShiftMask)
      {
        if (++bbTxAccAddrInvalidStep > 31)
        {
          bbTxAccAddrInvalidStep = 0;
        }
      }
      else
      {
        if (bbTxAccAddrShiftInc)
        {
          ++bbTxAccAddrInvalidStep;
        }
        else
        {
          --bbTxAccAddrInvalidStep;
        }

        if (bbTxAccAddrInvalidStep > 20 && bbTxAccAddrShiftInc)
        {
          bbTxAccAddrInvalidStep = 31;
          bbTxAccAddrShiftInc = FALSE;
        }
        else if (bbTxAccAddrInvalidStep < 12 && !bbTxAccAddrShiftInc)
        {
          bbTxAccAddrInvalidStep = 1;
          bbTxAccAddrShiftInc = TRUE;
        }
      }
    }
  }

  /* set Tx CRC init */
  NRF_RADIO->CRCINIT = bbTxCrcInit;
  if ((hdr & bbModifyTxHdrMask) == bbModifyTxHdrValue)
  {
    if (bbTxCrcInitInvalidChanMask & (UINT64_C(1) << bbChanIndex))
    {
      if (bbTxCrcInitInvalidAdjMask & (1 << bbTxCrcInitInvalidStep))
      {
        /* invalidate */
        NRF_RADIO->CRCINIT = bbTxCrcInit ^ 0xFFFFFF;
      }

      if (++bbTxCrcInitInvalidStep > 31)
      {
        bbTxCrcInitInvalidStep = 0;
      }
    }
  }
#endif

  /* calculate start time */
  uint32_t txStart = BB_US_TO_BB_TICKS(bbAntennaDueTimeUsec - (NRF5x_tTXEN_BLE_USECS + NRF5x_PROP_DELAY_TX_USECS));

  /* set timer compare CC[0] for time to trigger a transmit */
#if (USE_RTC_BB_CLK)
  uint32_t txStartUsec = bbAntennaDueTimeUsec - (NRF5x_tTXEN_BLE_USECS + NRF5x_PROP_DELAY_TX_USECS);

  if (bbAntennaDueTimeUsec < NRF5x_tTXEN_BLE_USECS + NRF5x_PROP_DELAY_TX_USECS)
  {
    txStartUsec = bbAntennaDueTimeUsec - NRF5x_tTXEN_BLE_USECS - NRF5x_PROP_DELAY_TX_USECS + BB_RTC_MAX_VALUE_US + 1;
  }

  txStart = BB_US_TO_BB_TICKS(txStartUsec);

  int16_t dueOffsetUsec = txStartUsec - BB_TICKS_TO_US(txStart);

  bbDueOffsetUsec = dueOffsetUsec > 0 ? dueOffsetUsec : 0;

  if (bbDueOffsetUsec > 31)
  {
    bbDueOffsetUsec = 31;
  }

  if (bbDueOffsetUsec == 0)
  {
    bbDueOffsetUsec = 1;                /* CC[0] can't trigger on 0 */
  }

