ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
        /* no, TIFS was missed, indicate via callback */
        palBbRestoreTrl();
        bbTxCallback(BB_STATUS_FAILED);
        return;  /* exit from here... on purpose, alternative coding is ugly */
      }

      /////////////////////////////////////////////////////////////////////////////////
      #ifdef DIAGNOSTICS
      diagTxTifsBlueMoonWin++;
      #endif
      /////////////////////////////////////////////////////////////////////////////////
    }

    /* update the driver state */
    driverState = TX_STATE;
  }

  /* -----------------------------------------------------------------------------*
   *                            TIFS "Not Possible"
   * -----------------------------------------------------------------------------*/
  else
  {
    /*
     *  The TIFS operation is not possible. Some reasons this could happen:
     *     - the TIFS "window of opportunity" has expired, it ramped up and then shut down
     *     - the previous operation timed out, or was cancelled
     *     - this is the wrong type of TIFS for the window (e.g. TX when ramping up for RX)
     *     - attempting this TIFS as the first operation
     *
     *  NOTE: The radio is not stopped. If an opposite type of TIFS is ramping up,
     *        the radio "TIFS Expired" interrupt will handle it.
     */

    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagTxTifsFailNotPossible++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////

    /* indicate that this TIFS operation is not possible */
    palBbRestoreTrl();
    bbTxCallback(BB_STATUS_FAILED);
  }
}

/*===============================================================================================*/
/*!
 *  \brief      Configure radio for transmit.
 *
 *  \param      pTxBuf - pointer to buffer to transmit
 *
 *  Configuration common to TIFS and non-TIFS transmit.
 *
 */
/*===============================================================================================*/
static void palBbTxHwRadioConfig(uint8_t * pTxBuf)
{
#if defined(NRF52840_XXAA)
  if (bbTxPhy == BB_PHY_BLE_CODED)
  {
    /* Improve Coded sensitivity for nRF52840 chip. */
    *(volatile uint32_t *)0x4000173C |= 0x80000000;
    *(volatile uint32_t *)0x4000173C = ((*(volatile uint32_t *)0x4000173C & 0xFFFFFF00) | 0x5C);
  }

  uint32_t plen = ((bbTxPhy != BB_PHY_BLE_1M) ? ((bbTxPhy != BB_PHY_BLE_2M) ? RADIO_PCNF0_PLEN_LongRange : RADIO_PCNF0_PLEN_16bit) \
                  : RADIO_PCNF0_PLEN_8bit) << RADIO_PCNF0_PLEN_Pos;
#elif defined(NRF52832_XXAA)
  uint32_t plen = ((bbTxPhy == BB_PHY_BLE_2M) ? RADIO_PCNF0_PLEN_16bit : RADIO_PCNF0_PLEN_8bit) << RADIO_PCNF0_PLEN_Pos;
#else
  uint32_t plen = 0;
#endif

  /* set the mode */
  palBbSetRadioMode(bbTxPhy, bbTxPhyOptions);

  if (!bbEncryptTxFlag)
  {
    /*------------------------------------------------------------------------------
     *   No encryption.
     *
     *   When encryption is not needed, the Nordic hardware can be configured to
     *   enable extended packets. This configuration bypasses Nordic's specific
     *   format. This also allows for zero copy as well.
     *
     */

    /* configure PCNF0 */
    NRF_RADIO->PCNF0 = (((uint32_t)(  1   /* S0 field in bytes      */ ))  << RADIO_PCNF0_S0LEN_Pos)                              |
                       (((uint32_t)(  8   /* length field in bits   */ ))  << RADIO_PCNF0_LFLEN_Pos)                              |
                       (((uint32_t)(  0   /* S1 field in bits       */ ))  << RADIO_PCNF0_S1LEN_Pos)                              |
#if defined(NRF52840_XXAA)
                       (((uint32_t)((bbTxPhy == BB_PHY_BLE_CODED) ? 3 : 0 /* TERM field in bits*/ ))  << RADIO_PCNF0_TERMLEN_Pos) |
                       (((uint32_t)((bbTxPhy == BB_PHY_BLE_CODED) ? 2 : 0 /* CI field in bits  */ ))  << RADIO_PCNF0_CILEN_Pos)   |
                       (((uint32_t)(  0   /* CRCINC field           */ ))  << RADIO_PCNF0_CRCINC_Pos)                             |
                       (((uint32_t)(  0   /* S1INCL filed           */ ))  << RADIO_PCNF0_S1INCL_Pos)                             |
#endif
                       ((uint32_t)( plen /* preamble field in bits */ ));

    /* configure PCNF1 */
    NRF_RADIO->PCNF1 = (((uint32_t)(  0   /* maximum packet length  */ ))  << RADIO_PCNF1_MAXLEN_Pos  )  |
                       (((uint32_t)(  0   /* static packet length   */ ))  << RADIO_PCNF1_STATLEN_Pos )  |
                       (((uint32_t)( NORDIC_BASE_ADDR_LEN              ))  << RADIO_PCNF1_BALEN_Pos   )  |
                       (((uint32_t)( RADIO_PCNF1_ENDIAN_Little         ))  << RADIO_PCNF1_ENDIAN_Pos  )  |
                       (((uint32_t)( bbRadioPcnf1WhiteEn               ))  << RADIO_PCNF1_WHITEEN_Pos );

    /* set packet pointer to supplied buffer */
    NRF_RADIO->PACKETPTR = (uint32_t)pTxBuf;
  }
  else
  {
    /*------------------------------------------------------------------------------
     *   Encryption.
     *
     *   Nordic's encryption engine requires a precise format to function. The header
     *   is held in three bytes, instead of two. Each byte represents a field in the
     *   actual Bluetooth header. The Nordic hardware converts these three bytes into
     *   the two byte BLE header before transmitting.
     *
     *   To accommodate this hardware quirk, the buffer must be copied to adjust for
     *   the Nordic "extra byte." Zero copy is not possible. Also, extended packets
     *   are not possible.
     *
     *   NOTE:  Most of the CCM hardware is configured just once, in a different
     *          function, when encryption is first enabled.
     */

    BB_ASSERT( keySetFlag ); /* encryption key has not been set */
    BB_ASSERT( ivSetFlag ); /* iv was not set */
    BB_ASSERT( txPacketCountSetFlag ); /* packet count was not set */
    BB_ASSERT( directionSetFlag ); /* direction was not set */

    /* configure PCNF0 */
    NRF_RADIO->PCNF0 = (((uint32_t)(  1   /* S0 field in bytes      */ ))  << RADIO_PCNF0_S0LEN_Pos)                              |
                       (((uint32_t)(  8   /* length field in bits   */ ))  << RADIO_PCNF0_LFLEN_Pos)                              |
                       (((uint32_t)(  0   /* S1 field in bits       */ ))  << RADIO_PCNF0_S1LEN_Pos)                              |
#if defined(NRF52840_XXAA)
                       (((uint32_t)((bbTxPhy == BB_PHY_BLE_CODED) ? 3 : 0 /* TERM field in bits*/ ))  << RADIO_PCNF0_TERMLEN_Pos) |
                       (((uint32_t)((bbTxPhy == BB_PHY_BLE_CODED) ? 2 : 0 /* CI field in bits  */ ))  << RADIO_PCNF0_CILEN_Pos)   |
                       (((uint32_t)(  0   /* CRCINC field           */ ))  << RADIO_PCNF0_CRCINC_Pos)                             |
                       (((uint32_t)(  1   /* S1INCL field           */ ))  << RADIO_PCNF0_S1INCL_Pos)                             |
#endif
                       ((uint32_t)( plen /* preamble field in bits */ ));

