ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
#if (LL_ENABLE_TESTER)
  if ((llTesterCb.pktMic) || (llTesterCb.pktLlId))
  {
    BB_ASSERT(NRF_CCM->EVENTS_ENDCRYPT); /* this event should have been set */

    /* disable this interrupt */
    NRF_CCM->INTENCLR = CCM_INTENCLR_ENDCRYPT_Msk;

    bbEncryptEncryptedBuf[0] ^= llTesterCb.pktLlId & 0x03;

    bbEncryptEncryptedBuf[bbTxLen] ^= (llTesterCb.pktMic >>  0) & 0xFF;
    bbEncryptEncryptedBuf[bbTxLen+1] ^= (llTesterCb.pktMic >>  8) & 0xFF;
    bbEncryptEncryptedBuf[bbTxLen+2] ^= (llTesterCb.pktMic >> 16) & 0xFF;
    bbEncryptEncryptedBuf[bbTxLen+3] ^= (llTesterCb.pktMic >> 24) & 0xFF;
  }
#endif
}

/*************************************************************************************************/
/*!
 *  \brief      Receive packet at the given due time.
 *
 *  \param      pBuf        Transmit data buffer.
 *  \param      len         Length of data buffer.
 *
 *  The receiver is kept on for the amount of time previously configured by function call.
 */
/*************************************************************************************************/
void PalBbBleRxData(uint8_t *pBuf, uint16_t len)
{
  BB_ASSERT(driverState == IDLE_STATE);                   /* driver must be idle */
  BB_ASSERT(bbRxCallback != NULL);                        /* callback must be configured */
  BB_ASSERT(len >= PDU_HEADER_LEN);                       /* buffer must include room for a two byte header */
  BB_ASSERT(len <= (PDU_HEADER_LEN + MAX_PAYLOAD_LEN));   /* buffer should not exceed header + max payload size */
  BB_ALIGN_ASSERT(pBuf);

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  BB_ASSERT(diagOp == DIAG_NULL);
  diagOp = DIAG_RX;
  diagRxTotalCalls++;
  diagRxCalls++;
  #endif
  /////////////////////////////////////////////////////////////////////////////////

#if (LL_ENABLE_TESTER == TRUE)
  /* set Rx access addresses */
  NRF_RADIO->PREFIX0 = (bbRxAccAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (bbRxAccAddr & 0x00FFFFFF) <<  8;
  if (invalidateAccAddrOnceRx)
  {
    invalidateAccAddrOnceRx = FALSE;

    /* invalidate */
    NRF_RADIO->PREFIX0 = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
    NRF_RADIO->BASE0   = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
  }

  if (bbRxAccAddrInvalidChanMask & (UINT64_C(1) << bbChanIndex))
  {
    if (bbRxAccAddrInvalidAdjMask & (1 << bbRxAccAddrInvalidStep))
    {
      /* invalidate */
      NRF_RADIO->PREFIX0 = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
      NRF_RADIO->BASE0   = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
    }

    if (++bbRxAccAddrInvalidStep > 31)
    {
      bbRxAccAddrInvalidStep = 0;
    }
  }

  /* set Rx CRC init */
  NRF_RADIO->CRCINIT = bbRxCrcInit;
  if (bbRxCrcInitInvalidChanMask & (UINT64_C(1) << bbChanIndex))
  {
    if (bbRxCrcInitInvalidAdjMask & (1 << bbRxCrcInitInvalidStep))
    {
      /* invalidate */
      bbRxCrcInitInvalidStep--;
      NRF_RADIO->CRCINIT = bbRxCrcInit ^ 0xFFFFFF;
    }

    if (++bbRxCrcInitInvalidStep > 31)
    {
      bbRxCrcInitInvalidStep = 0;
    }
  }
#endif

  /*
   *   In case there is a TIFS operation ramping up, kill it.
   *   This non-TIFS operation is coming through.
   */
  palBbRadioHardStop();

  /* calculate start time */
  uint32_t rxStart = BB_US_TO_BB_TICKS(bbAntennaDueTimeUsec - (NRF5x_tRXEN_BLE_USECS + NRF5x_PROP_DELAY_RX_USECS));

  /* set timer compare CC[0] for time to trigger a transmit */
#if (USE_RTC_BB_CLK)
  uint32_t rxStartUsec = bbAntennaDueTimeUsec - (NRF5x_tRXEN_BLE_USECS + NRF5x_PROP_DELAY_RX_USECS);

  if (bbAntennaDueTimeUsec < NRF5x_tRXEN_BLE_USECS + NRF5x_PROP_DELAY_RX_USECS)
  {
    rxStartUsec = bbAntennaDueTimeUsec - NRF5x_tRXEN_BLE_USECS - NRF5x_PROP_DELAY_RX_USECS + BB_RTC_MAX_VALUE_US + 1;
  }

  rxStart = BB_US_TO_BB_TICKS(rxStartUsec);

  int16_t dueOffsetUsec = rxStartUsec - BB_TICKS_TO_US(rxStart);

  bbDueOffsetUsec = dueOffsetUsec > 0 ? dueOffsetUsec : 0;

  if (bbDueOffsetUsec > 31)
  {
    bbDueOffsetUsec = 31;
  }

  if (bbDueOffsetUsec == 0)
  {
    bbDueOffsetUsec = 1;                /* CC[0] can't trigger on 0 */
  }

  PAL_BB_TIMER->CC[0] = bbDueOffsetUsec;
  PAL_BB_TIMER->EVENTS_COMPARE[0] = 0;
  WAIT_FOR_WR_BUF_EMPTY(PAL_BB_TIMER->EVENTS_COMPARE[0]);
  palBbStartTimer(rxStart - 1);        /* Subtract 1 for receive uncertainty due to rounding. */
#else
  BB_ASSERT(bbDueOffsetUsec == 0);     /* Always 0 with HFCLK. */
  PAL_BB_TIMER->CC[0] = rxStart;
  PAL_BB_TIMER->EVENTS_COMPARE[0] = 0;
  WAIT_FOR_WR_BUF_EMPTY(PAL_BB_TIMER->EVENTS_COMPARE[0]);
#endif

#if (USE_RTC_BB_CLK)
  /* Since receive timestamp rounds down to RTC clock, extend timeout up to 31us
   * to makeup for rounding error. */
  bbRxTimeoutUsec += 31;
#endif

  uint32_t preambleTime;
  uint32_t accessAddrTime;
  int32_t correction;

  switch (bbRxPhy)
  {
    case BB_PHY_BLE_1M:
      preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
      accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
      correction = 0;
      break;
    case BB_PHY_BLE_2M:
      preambleTime = LL_BLE_US_PER_BYTE_2M * LL_PREAMBLE_LEN_2M;
      accessAddrTime = LL_BLE_US_PER_BYTE_2M * LL_AA_LEN;
      correction = 0;
      break;
#if defined(NRF52840_XXAA)
    case BB_PHY_BLE_CODED:
      preambleTime = LL_BLE_US_PER_BIT_CODED_S8 * LL_PREAMBLE_LEN_CODED_BITS;
      accessAddrTime = LL_BLE_US_PER_BYTE_CODED_S8 * LL_AA_LEN;
      correction = 100;
      break;
#endif
    default:
      preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
      accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
      correction = 0;
    }
  /* set timer compare CC[1] for RX timeout (allow time to recognize address, and account for propagation delay) */
  PAL_BB_TIMER->CC[1]  = PAL_BB_TIMER->CC[0]
                       + TICKS_PER_USEC * (bbRxTimeoutUsec
                                           + preambleTime
                                           + accessAddrTime
                                           + NRF5x_PROP_DELAY_RX_USECS
                                           + NRF5x_tRXEN_BLE_USECS
                                           + correction);

  /* clear RX timeout compare event, but do not enable interrupt, that happens in radio isr */
  PAL_BB_TIMER->EVENTS_COMPARE[1] = 0;
  WAIT_FOR_WR_BUF_EMPTY(PAL_BB_TIMER->EVENTS_COMPARE[1]);

  /* configure radio hardware registers for receive */
  palBbRxHwRadioConfig(pBuf, len);

  /* configure shortcuts */
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk        |
                      RADIO_SHORTS_END_DISABLE_Msk        |
                      RADIO_SHORTS_ADDRESS_RSSISTART_Msk  |
                      RADIO_SHORTS_DISABLED_RSSISTOP_Msk;

  uint32_t currentBbTick = PalBbGetCurrentTime();

  /* see if the due time is in the past (or a very long way, away) */
#if (USE_RTC_BB_CLK)
  if ((rxStart - currentBbTick) & 0x00800000) /* Check MSB of 24 bit RTC counter. */
#else
  if ((rxStart - currentBbTick) & 0x80000000)
#endif
  {
    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagRxFailBadDueTime++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////

