ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
    /* run the callback function */
    bbRxCallback(BB_STATUS_FAILED, 0 ,0, 0, 0);
    return;
  }

  /* configure and enable PPI Chan 14, COMPARE[0] -> RXEN */
  NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_RXEN;  /* configure task */
  NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                  /* enable channel */

  /* see if the compare point was already reached */
  if (PAL_BB_TIMER->EVENTS_COMPARE[0])
  {
    /* it's 99.99999% certain did not make it, but... maybe, just maybe... */
    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled)
    {
      /////////////////////////////////////////////////////////////////////////////////
      #ifdef DIAGNOSTICS
      diagRxFailMissedDueTime++;
      #endif
      /////////////////////////////////////////////////////////////////////////////////

      /* run the callback function */
      bbRxCallback(BB_STATUS_FAILED, 0, 0, 0, 0);
      return;
    }

    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagRxBlueMoonWin++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////
  }

  /* update the driver state */
  driverState = RX_STATE;
}

/*************************************************************************************************/
/*!
 *  \brief      Receive packet on TIFS timing.
 *
 *  \param      pBuf        Receive data buffer.
 *  \param      len         Length of data buffer.
 *
 *  The receiver is left on for the minimum amount of time to recognize a receive.
 *
 *  If possible, the receive will occur on the TIFS timing. If not possible, the callback status
 *  will indicate this.
 */
/*************************************************************************************************/
void PalBbBleRxTifsData(uint8_t *pBuf, uint16_t len)
{
  BB_ASSERT(driverState == IDLE_STATE); /* driver must be idle */
  BB_ASSERT(bbRxCallback != NULL);      /* callback must be configured */
  BB_ASSERT(len >= PDU_HEADER_LEN);                       /* buffer must include room for a two byte header */
  BB_ASSERT(len <= (PDU_HEADER_LEN + MAX_PAYLOAD_LEN));   /* buffer should not exceed header + max payload size */
  BB_ALIGN_ASSERT(pBuf);

  /////////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  BB_ASSERT(diagOp == DIAG_NULL);
  diagOp = DIAG_RX_TIFS;
  diagRxTotalCalls++;
  diagRxTifsCalls++;
  #endif
  /////////////////////////////////////////////////////////////////////////////////

#if (LL_ENABLE_TESTER == TRUE)
  /* set Rx access addresses */
  NRF_RADIO->PREFIX0 = (bbRxAccAddr & 0xFF000000) >> 24;
  NRF_RADIO->BASE0   = (bbRxAccAddr & 0x00FFFFFF) <<  8;
  if (invalidateAccAddrOnceRx)
  {
    invalidateAccAddrOnceRx = FALSE;

    /* invalidate */
    NRF_RADIO->PREFIX0 = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
    NRF_RADIO->BASE0   = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
  }

  if (bbRxAccAddrInvalidChanMask & (UINT64_C(1) << bbChanIndex))
  {
    if (bbRxAccAddrInvalidAdjMask & (1 << bbRxAccAddrInvalidStep))
    {
      /* invalidate */
      NRF_RADIO->PREFIX0 = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0xFF000000) >> 24;
      NRF_RADIO->BASE0   = ((bbRxAccAddr ^ 0xFFFFFFFF) & 0x00FFFFFF) <<  8;
    }

    if (++bbRxAccAddrInvalidStep > 31)
    {
      bbRxAccAddrInvalidStep = 0;
    }
  }

  /* set Rx CRC init */
  NRF_RADIO->CRCINIT = bbRxCrcInit;
  if (bbRxCrcInitInvalidChanMask & (UINT64_C(1) << bbChanIndex))
  {
    if (bbRxCrcInitInvalidAdjMask & (1 << bbRxCrcInitInvalidStep))
    {
      /* invalidate */
      bbRxCrcInitInvalidStep--;
      NRF_RADIO->CRCINIT = bbRxCrcInit ^ 0xFFFFFF;
    }

    if (++bbRxCrcInitInvalidStep > 31)
    {
      bbRxCrcInitInvalidStep = 0;
    }
  }
#endif

  /*
   *  NOTE: To make the TIFS timing requirements, timer CC[0] and PPI Chan 14 were previously
   *        configured at the end of the last transmit. The RXEN task will trigger on the next
   *        timer COMPARE0 event.
   */

  /* configure radio hardware registers for receive */
  palBbRxHwRadioConfig(pBuf, len);

  /* -----------------------------------------------------------------------------*
   *                             TIFS "Ramping Up"
   * -----------------------------------------------------------------------------*/
  if (tifsState == TIFS_RX_RAMPUP)
  {
    /* assert that the READY-to-START shortcut is not set */
    BB_ASSERT((NRF_RADIO->SHORTS & RADIO_SHORTS_READY_START_Msk) == 0);

    /* radio should be ramping up, set shortcuts (previously READY-to-START shortcut was not set) */
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk        |
                        RADIO_SHORTS_END_DISABLE_Msk        |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk  |
                        RADIO_SHORTS_DISABLED_RSSISTOP_Msk;

    /* if the READY event has already happened... TIFS almost certainly did not go out */
    if (NRF_RADIO->EVENTS_READY)
    {
      /* but maybe, just maybe, TIFS did go out... */
      if (NRF_RADIO->STATE != RADIO_STATE_STATE_Rx)
      {
        /////////////////////////////////////////////////////////////////////////////////
        #ifdef DIAGNOSTICS
        diagRxTifsFailMissed++;
        #endif
        /////////////////////////////////////////////////////////////////////////////////

        /* no, TIFS was missed, indicate via callback */
        bbRxCallback(BB_STATUS_FAILED, 0, 0, 0, 0);
        return; /* exit from here... on purpose, alternative coding is ugly */
      }

      /////////////////////////////////////////////////////////////////////////////////
      #ifdef DIAGNOSTICS
      diagRxTifsBlueMoonWin++;
      #endif
      /////////////////////////////////////////////////////////////////////////////////
    }

    /* update the driver state */
    driverState = RX_STATE;
  }

  /* -----------------------------------------------------------------------------*
   *                            TIFS "Not Possible"
   * -----------------------------------------------------------------------------*/
  else
  {
    /////////////////////////////////////////////////////////////////////////////////
    #ifdef DIAGNOSTICS
    diagRxTifsFailNotPossible++;
    #endif
    /////////////////////////////////////////////////////////////////////////////////

    /* indicate that this TIFS operation is not possible */
    bbRxCallback(BB_STATUS_FAILED, 0, 0, 0, 0);
  }
}

/*===============================================================================================*/
/*
 *  \brief      Configure radio for receive.
 *
 *  \param      pRxBuf - pointer where receive bytes get written
 *  \param      len    - maximum length for receive, i.e. size of the allocated receive buffer
 *
 *  Configuration common to TIFS and non-TIFS transmit.
 *
 */
/*===============================================================================================*/
static void palBbRxHwRadioConfig(uint8_t * pRxBuf, uint16_t len)
{
  BB_ASSERT(len >= PDU_HEADER_LEN); /* buffer must at least accommodate the header */

#if defined(NRF52840_XXAA)
    if (bbTxPhy == BB_PHY_BLE_CODED)
    {
      /* Improve Coded sensitivity for nRF52840 chip. */
      *(volatile uint32_t *)0x4000173C |= 0x80000000;
      *(volatile uint32_t *)0x4000173C = ((*(volatile uint32_t *)0x4000173C & 0xFFFFFF00) | 0x5C);
    }

    uint32_t plen = ((bbRxPhy != BB_PHY_BLE_1M) ? ((bbRxPhy != BB_PHY_BLE_2M) ? RADIO_PCNF0_PLEN_LongRange : RADIO_PCNF0_PLEN_16bit) \
    : RADIO_PCNF0_PLEN_8bit) << RADIO_PCNF0_PLEN_Pos;
#elif defined(NRF52832_XXAA)
    uint32_t plen = ((bbRxPhy == BB_PHY_BLE_2M) ? RADIO_PCNF0_PLEN_16bit : RADIO_PCNF0_PLEN_8bit) << RADIO_PCNF0_PLEN_Pos;
#else
    uint32_t plen = 0;
#endif

  /* set the mode */
  palBbSetRadioMode(bbRxPhy, bbTxPhyOptions);

  if (!bbDecryptRxFlag)
  {
    /* No decryption */
    /* configure PCNF0 */
    NRF_RADIO->PCNF0 = (((uint32_t)(  1   /* S0 field in bytes      */ ))  << RADIO_PCNF0_S0LEN_Pos)                              |
                     (((uint32_t)(  8   /* length field in bits   */ ))  << RADIO_PCNF0_LFLEN_Pos)                              |
                     (((uint32_t)(  0   /* S1 field in bits       */ ))  << RADIO_PCNF0_S1LEN_Pos)                              |
#if defined(NRF52840_XXAA)
                     (((uint32_t)((bbRxPhy == BB_PHY_BLE_CODED) ? 3 : 0 /* TERM field in bits*/ ))  << RADIO_PCNF0_TERMLEN_Pos) |
                     (((uint32_t)((bbRxPhy == BB_PHY_BLE_CODED) ? 2 : 0 /* CI field in bits  */ ))  << RADIO_PCNF0_CILEN_Pos)   |
                     (((uint32_t)(  0   /* CRCINC field           */ ))  << RADIO_PCNF0_CRCINC_Pos)                             |
                     (((uint32_t)(  0   /* S1INCL filed           */ ))  << RADIO_PCNF0_S1INCL_Pos)                             |
#endif
                     ((uint32_t)( plen /* preamble field in bits */ ));

