ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
    /* configure PCNF1 */
    NRF_RADIO->PCNF1  = (((uint32_t)( len - PDU_HEADER_LEN        /* max len    */ ))  << RADIO_PCNF1_MAXLEN_Pos  )  |
                      (((uint32_t)( 0                           /* static len */ ))  << RADIO_PCNF1_STATLEN_Pos )  |
                      (((uint32_t)( NORDIC_BASE_ADDR_LEN                         ))  << RADIO_PCNF1_BALEN_Pos   )  |
                      (((uint32_t)( RADIO_PCNF1_ENDIAN_Little                    ))  << RADIO_PCNF1_ENDIAN_Pos  )  |
                      (((uint32_t)( bbRadioPcnf1WhiteEn                          ))  << RADIO_PCNF1_WHITEEN_Pos );

    /* set up memory location where received packet gets stored */
    NRF_RADIO->PACKETPTR = (uint32_t)pRxBuf;

  }
  else
  {
    /* Decryption */
    BB_ASSERT( keySetFlag ); /* encryption key has not been set */
    BB_ASSERT( ivSetFlag ); /* iv was not set */
    BB_ASSERT( rxPacketCountSetFlag ); /* packet count was not set */
    BB_ASSERT( directionSetFlag ); /* direction was not set */
    BB_ASSERT( encryptTypeSetFlag ); /* decrypt type was not set */

    /* configure PCNF0 */
    NRF_RADIO->PCNF0 = (((uint32_t)(  1   /* S0 field in bytes      */ ))  << RADIO_PCNF0_S0LEN_Pos)                              |
                       (((uint32_t)(  8   /* length field in bits   */ ))  << RADIO_PCNF0_LFLEN_Pos)                              |
                       (((uint32_t)(  0   /* S1 field in bits       */ ))  << RADIO_PCNF0_S1LEN_Pos)                              |
#if defined(NRF52840_XXAA)
                       (((uint32_t)((bbRxPhy == BB_PHY_BLE_CODED) ? 3 : 0 /* TERM field in bits*/ ))  << RADIO_PCNF0_TERMLEN_Pos) |
                       (((uint32_t)((bbRxPhy == BB_PHY_BLE_CODED) ? 2 : 0 /* CI field in bits  */ ))  << RADIO_PCNF0_CILEN_Pos)   |
                       (((uint32_t)(  0   /* CRCINC field           */ ))  << RADIO_PCNF0_CRCINC_Pos)                             |
                       (((uint32_t)(  1   /* S1INCL field           */ ))  << RADIO_PCNF0_S1INCL_Pos)                             |
#endif
                       ((uint32_t)( plen /* preamble field in bits */ ));

    /* configure PCNF1 */
    NRF_RADIO->PCNF1 = (((uint32_t)(  len - PDU_HEADER_LEN   /* maximum packet length  */ ))  << RADIO_PCNF1_MAXLEN_Pos  )  |
                       (((uint32_t)(  0   /* static packet length   */ ))  << RADIO_PCNF1_STATLEN_Pos )  |
                       (((uint32_t)( NORDIC_BASE_ADDR_LEN              ))  << RADIO_PCNF1_BALEN_Pos   )  |
                       (((uint32_t)( RADIO_PCNF1_ENDIAN_Little         ))  << RADIO_PCNF1_ENDIAN_Pos  )  |
                       (((uint32_t)( bbRadioPcnf1WhiteEn               ))  << RADIO_PCNF1_WHITEEN_Pos );

    /* set packet pointer to the encrypted buffer */
    NRF_RADIO->PACKETPTR = (uint32_t)&bbEncryptEncryptedBuf[0];

    /* update decryption direction for ACL/CIS */
    if ((bbEncryptType == PAL_BB_TYPE_ACL) || (bbEncryptType == PAL_BB_TYPE_CIS))
    {
      bbEncryptCcmData[24] = !bbEncryptDirection;
    }
    else
    {
      bbEncryptCcmData[24] = bbEncryptDirection;
    }

    /* set decrypt packet counter */
    bbEncryptCcmData[16] = (bbDecryptPacketCounter >>  0) & 0xFF;
    bbEncryptCcmData[17] = (bbDecryptPacketCounter >>  8) & 0xFF;
    bbEncryptCcmData[18] = (bbDecryptPacketCounter >> 16) & 0xFF;
    bbEncryptCcmData[19] = (bbDecryptPacketCounter >> 24) & 0xFF;
    bbEncryptCcmData[20] = (bbDecryptPacketCounter >> 32) & 0x7F; /* only 7-bits of MSB are used (packet count is 39 bits) */

    NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Disabled << CCM_ENABLE_ENABLE_Pos);
    NRF_CCM->ENABLE = (CCM_ENABLE_ENABLE_Enabled  << CCM_ENABLE_ENABLE_Pos);

    NRF_CCM->CNFPTR     = (uint32_t)bbEncryptCcmData;
    NRF_CCM->SCRATCHPTR = (uint32_t)bbEncryptScratchBuf;

    NRF_CCM->INPTR  = (uint32_t)bbEncryptEncryptedBuf;
    NRF_CCM->OUTPTR = (uint32_t)pRxBuf;

    uint32_t ccmModeDatarate;
    switch (bbRxPhy)
    {
      default:
      case BB_PHY_BLE_1M:
        ccmModeDatarate = CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
        break;
      case BB_PHY_BLE_2M:
        ccmModeDatarate = CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos;
        break;
#if defined(NRF52840_XXAA)
      case BB_PHY_BLE_CODED:
        ccmModeDatarate = ((bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? CCM_MODE_DATARATE_500Kbps : CCM_MODE_DATARATE_125Kbps)
                          << CCM_MODE_DATARATE_Pos;
        break;
#endif
    }

    NRF_CCM->MODE = (CCM_MODE_MODE_Decryption << CCM_MODE_MODE_Pos) |
                    (ccmModeDatarate) |
                    (CCM_MODE_LENGTH_Extended << CCM_MODE_LENGTH_Pos);

    NRF_CCM->EVENTS_ENDCRYPT = 0;
    NRF_CCM->EVENTS_ENDKSGEN = 0;
    NRF_CCM->EVENTS_ERROR    = 0;

    /* disable shortcut between ENDKSGEN and CRYPT for on-the-fly decryption */
    NRF_CCM->SHORTS = 0;

    /* enable PPI between RADIO->EVENTS_ADDRESS and CCM->TASKS_CRYPT*/
    NRF_PPI->CHENSET = PPI_CHENSET_CH25_Msk;

    /* start key stream generation */
    NRF_CCM->TASKS_KSGEN = 1;
  }

  /* remember where the receive buffer is located, used later when processing the completed receive */
  bbpRxBuf = pRxBuf;
}

/*************************************************************************************************/
/*!
 *  \brief      TIMER0 interrupt handler "RX Timeout"
 *
 *  \param      None.
 *
 *  This is the "RX Timeout" interrupt. No other functionality is shared on the TIMER0 interrupt.
 *  If the receive operation has not gotten started, it is cancelled.
 *
 */
/*************************************************************************************************/
void BbBleDrvTimerIRQHandler(void)
{
  /* -----------------------------------------------------------------------------*
   *                         COMPARE1 - "RX Timeout"
   * -----------------------------------------------------------------------------*/

  if (PAL_BB_TIMER->INTENSET & TIMER_INTENSET_COMPARE1_Msk)
  {
    BB_ASSERT(PAL_BB_TIMER->EVENTS_COMPARE[1]);
    BB_ASSERT(driverState == RX_STATE); /* an RX timeout should only occur for an RX */
    BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Rx); /* should only be timeout if receiver is actually on */

    /* disable this interrupt */
    PAL_BB_TIMER->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;

