ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
    /*   Once the ADDRESS event has happened, the receive will not be timed out. This event happens
     *   just after the incoming preamble/address has been recognized.
     */
    if (NRF_RADIO->EVENTS_ADDRESS == 0)
    {
      /* stop the radio */
      palBbRadioHardStop();

      /* send notification of timeout */
      bbRxCallback(BB_STATUS_RX_TIMEOUT, 0, 0, 0, 0);
    }
  }

  /* -----------------------------------------------------------------------------*
   *                         COMPARE5 - "Scheduler"
   * -----------------------------------------------------------------------------*/

  if (PAL_BB_TIMER->INTENSET & PAL_BB_TIMER_EXPIRY_INTENSET_MASK)
  {
    PalTimerStop();

    /* TODO move to private PAL header. */
    extern void (*palTimerExpCback)(void);
    if (palTimerExpCback)
    {
      palTimerExpCback();
    }
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Radio interrupt handler.
 *
 *  \param      None.
 *
 *  This the radio interrupt service routine.  It is at the heart of the baseband driver
 *  design. It handles the following interrupts:
 *
 *  1) READY or "TIFS Expired" Interrupt - This interrupt fires as soon as the radio
 *     ramps up and is 'ready'. It is used as timeout for any TIFS operation that may
 *     be coming up. Also, it enables the RX Timeout interrupt if a receive operation.
 *
 *  2) PAYLOAD or "Timestamp/TIFS Setup" Interrupt - This interrupt fires once the payload
 *     has completed, for either transmit or receive.  During this interrupt, the timestamp
 *     is collected and computed. The next potential TIFS operation is also set up.
 *
 *  3) DISABLED or "TX-RX Complete" Interrupt - This interrupt occurs at the completion of
 *     a receive or transmit. It runs the appropriate callback with the appropriate status.
 *     (NOTE: This interrupt is intentionally *not* the END interrupt, for bulletproof timing.)
 *
 */
/*************************************************************************************************/
void BbBleDrvRadioIRQHandler(void)
{
  /* -----------------------------------------------------------------------------*
   *                       READY  -  "TIFS Expired"
   * -----------------------------------------------------------------------------*/
  if ((NRF_RADIO->INTENSET & RADIO_INTENSET_READY_Msk) && NRF_RADIO->EVENTS_READY)
  {
    /* clear the event, leave the interrupt active */
    NRF_RADIO->EVENTS_READY = 0;
    WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_READY);

    /* disable the PPI channel of TX/RX operations */
    NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;  /* COMPARE[0] -> TXEN/RXEN */

    /* see if a TIFS operation is ramping up, and if so, see if it failed */
    if ( ((tifsState == TIFS_TX_RAMPUP) && (NRF_RADIO->STATE == RADIO_STATE_STATE_TxIdle)) ||
         ((tifsState == TIFS_RX_RAMPUP) && (NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle)))
    {
      palBbRadioHardStop();  /* note: tifs state is reset in this function */
      return;
    }

    if ((driverState == TX_STATE) || (tifsState == TIFS_TX_RAMPUP))
    {
      BB_LED_TX_ON();
      BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Tx);
    }

    /* if this is a receive, activate the pre-configured RX timeout */
    if ((driverState == RX_STATE) || (tifsState == TIFS_RX_RAMPUP))
    {
      BB_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Rx);
      BB_LED_RX_ON();

      /* clear the ADDRESS event, it will indicate if an RX timeout is possible */
      NRF_RADIO->EVENTS_ADDRESS = 0;
      WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_ADDRESS);

      /* enable the RX interrupt */
      PAL_BB_TIMER->INTENSET = TIMER_INTENSET_COMPARE1_Msk;

      /*  if the compare event is set, the RX timeout already occurred */
      if (PAL_BB_TIMER->EVENTS_COMPARE[1])
      {
        /* force a compare event, which will trigger the interrupt (it was disabled when the actual event happened) */
        PAL_BB_TIMER->EVENTS_COMPARE[1] = 1;
      }
    }

    /* update tifs state */
    tifsState = TIFS_NULL;
  }

  /* -----------------------------------------------------------------------------*
   *                      PAYLOAD  -  "Timestamp/TIFS Setup"
   * -----------------------------------------------------------------------------*/
  else if ((NRF_RADIO->INTENSET & RADIO_INTENSET_PAYLOAD_Msk) && NRF_RADIO->EVENTS_PAYLOAD)
  {
    /* clear the event, leave the interrupt active */
    NRF_RADIO->EVENTS_PAYLOAD = 0;
    WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_PAYLOAD);

    /* disable the "RX Timeout" interrupt (timer COMPARE1 event) */
    PAL_BB_TIMER->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;
    NVIC_ClearPendingIRQ(PAL_BB_IRQn); /* necessary, if interrupt already "fired" this is the only way to clear it */

    /*
     *  Setup for potential TIFS operation.
     *
     *  Every transmit and every receive has a potential follow-up TIFS operation.
     *  To accommodate this, the radio must start ramping up before it knows
     *  if the operation is going to happen or not.
     *
     */
    BB_ASSERT((NRF_PPI->CHENSET & PPI_CHENSET_CH14_Msk) == 0); /* channel should be disabled by now */

    /* clear radio shortcuts except for END->DISABLE (must not have ENABLE->START shortcut active) */
    NRF_RADIO->SHORTS = RADIO_SHORTS_END_DISABLE_Msk;

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *            TX, set up for TIFS-RX
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    if ((bbOpParam.ifsMode == PAL_BB_IFS_MODE_TOGGLE_TIFS) &&
        (driverState == TX_STATE))
    {
      uint32_t antennaTimeTxPktEnd;
      uint32_t crcTime;
      uint32_t term2Time;
      uint32_t preambleTime;
      uint32_t accessAddrTime;
      int32_t correction;

      /* calculate time to transmit CRC and TERM2 (Long Range Only) */
      switch (bbTxPhy)
      {
        case BB_PHY_BLE_1M:
          crcTime = LL_BLE_US_PER_BYTE_1M * LL_CRC_LEN;
          term2Time = 0;
          break;
        case BB_PHY_BLE_2M:
          crcTime = LL_BLE_US_PER_BYTE_2M * LL_CRC_LEN;
          term2Time = 0;
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          crcTime = ((bbTxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? LL_BLE_US_PER_BYTE_CODED_S2 : LL_BLE_US_PER_BYTE_CODED_S8) * LL_CRC_LEN;
          term2Time = ((bbTxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? LL_BLE_US_PER_BIT_CODED_S2 : LL_BLE_US_PER_BIT_CODED_S8) * LL_TERM2_LEN_BITS;
          break;
#endif
        default:
          crcTime = LL_BLE_US_PER_BYTE_1M * LL_CRC_LEN;
          term2Time = 0;
      }

