ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
      /* calculate time to receive preamble and access address */
      switch(bbRxPhy)
      {
        case BB_PHY_BLE_1M:
          preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
          accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
          correction = 4;
          break;
        case BB_PHY_BLE_2M:
          preambleTime = LL_BLE_US_PER_BYTE_2M * LL_PREAMBLE_LEN_2M;
          accessAddrTime = LL_BLE_US_PER_BYTE_2M * LL_AA_LEN;
          correction = 20;
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          preambleTime = LL_BLE_US_PER_BIT_CODED_S8 * LL_PREAMBLE_LEN_CODED_BITS;
          accessAddrTime = LL_BLE_US_PER_BYTE_CODED_S8 * LL_AA_LEN;
          correction = 110;
          break;
#endif
        default:
          preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
          accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
          correction = 4;
      }

      /*
       *   Calculate "antenna time" when the packet ended.
       *
       *   The timer was captured into CC[2] triggered by the PAYLOAD event.
       *   The time for the CRC is added to get to the end of the packet.
       *   The transmit propagation delay from event to antenna is added to get the actual "antenna time" when the
       *   last transmitted bit finishes at the antenna.
       */
      antennaTimeTxPktEnd =  PAL_BB_TIMER->CC[2]                                        /* start with timer value when payload just finished */
                              + TICKS_PER_USEC * crcTime                              /* add CRC time to arrive at end of packet */
                              + TICKS_PER_USEC * term2Time                            /* add TERM2 time to arrive at end of packet */
                              + TICKS_PER_USEC * NRF5x_PROP_DELAY_TX_USECS;           /* add propagation delay to get "antenna time" */

      /* set timer trigger for upcoming TIFS receive operation */
      PAL_BB_TIMER->CC[0]   =  antennaTimeTxPktEnd                                      /* start with "antenna time" at end of packet just transmitted */
                              + TICKS_PER_USEC * LL_BLE_TIFS_US                       /* add the TIFS period */
                              - TICKS_PER_USEC * NRF5x_tRXEN_BLE_USECS                /* subtract time it takes to ramp-up for receive */
                              - TICKS_PER_USEC * MAX_TIFS_DEVIATION_USECS;            /* subtract allowed deviation */

      /* configure and enable PPI trigger for RXEN, happens on next timer COMPARE[0] just configured above */
      NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_RXEN;                        /* configure task */
      NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                                        /* enable channel */

      /* calculate and set RX timeout */
      PAL_BB_TIMER->CC[1] = antennaTimeTxPktEnd                                                             /* start with "antenna time" at end of packet just transmitted */
                            + TICKS_PER_USEC * LL_BLE_TIFS_US                                             /* add the TIFS period */
                            + TICKS_PER_USEC * preambleTime                                               /* allow time preamble to be received */
                            + TICKS_PER_USEC * accessAddrTime                                             /* allow time access address to be received */
                            + TICKS_PER_USEC * (2 * MAX_TIFS_DEVIATION_USECS)                             /* add allowed tolerance  +2/-2 usecs */
                            + TICKS_PER_USEC * correction;                                                         /* empirically derived trim factor (NOTE!! units are ticks, scaler change affects this) */
      /*
       *  NOTE:  In the case of an RX timeout, the above compare will trigger an interrupt.
       *         This interrupt requires time to execute. This delay extends the time the radio
       *         is active. The effective timeout period is longer than computed above.
       *
       *         This effective timeout period can be reduced using the trim value.
       *         This would be useful for power savings. But be warned!! Great care
       *         is required as this involves timing the speed of code execution.
       *         Any adjustment must be made with debug code disabled.
       */

      /* clear RX timeout compare event, but do not enable interrupt, that happens in radio isr */
      PAL_BB_TIMER->EVENTS_COMPARE[1] = 0;
      WAIT_FOR_WR_BUF_EMPTY(PAL_BB_TIMER->EVENTS_COMPARE[1]);

      /* a TX is completing, the radio will soon be ramping up for possible TIFS RX */
      tifsState = TIFS_RX_RAMPUP;
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *              RX, set up for TIFS-TX
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else if ((bbOpParam.ifsMode == PAL_BB_IFS_MODE_TOGGLE_TIFS) &&
             (driverState == RX_STATE))
    {
      uint32_t antennaTimeRxPktEnd;
      uint32_t crcTime;
      int32_t  rxCorrection;
      int32_t  txCorrection;
      uint32_t term2Time;

      BB_ASSERT(driverState == RX_STATE); /* illegal driver state */
#if defined(NRF52840_XXAA)
      if (NRF_RADIO->EVENTS_RATEBOOST == 1)
      {
        /* If rate boost events is detected, then  will use Coded S2, otherwise will use Coded S8 by default */
        bbRxPhyOptions = BB_PHY_OPTIONS_BLE_S2;
        NRF_RADIO->EVENTS_RATEBOOST = 0;
      }
      else
      {
        bbRxPhyOptions = BB_PHY_OPTIONS_BLE_S8;
      }
#endif
      /* calculate time to transmit CRC and TERM2(Long Range Only) */
      switch (bbRxPhy)
      {
        case BB_PHY_BLE_1M:
          crcTime = LL_BLE_US_PER_BYTE_1M * LL_CRC_LEN;
          term2Time = 0;
          rxCorrection = -2;
          break;
        case BB_PHY_BLE_2M:
          crcTime = LL_BLE_US_PER_BYTE_2M * LL_CRC_LEN;
          term2Time = 0;
          rxCorrection = 2;
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          crcTime = ((bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? LL_BLE_US_PER_BYTE_CODED_S2 : LL_BLE_US_PER_BYTE_CODED_S8) * LL_CRC_LEN;
          term2Time = ((bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? LL_BLE_US_PER_BIT_CODED_S2 : LL_BLE_US_PER_BIT_CODED_S8) * LL_TERM2_LEN_BITS;
          rxCorrection = (bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? -49 : -180;
          break;
#endif
        default:
          crcTime = LL_BLE_US_PER_BYTE_1M * LL_CRC_LEN;
          term2Time = 0;
          rxCorrection = -2;
      }

      switch (bbTxPhy)
      {
        case BB_PHY_BLE_1M:
          txCorrection = 0;
          break;
        case BB_PHY_BLE_2M:
          txCorrection = +1;
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          txCorrection = -1;
          break;
#endif
        default:
          txCorrection = 0;
      }

      /* calculate "antenna time" when the packet ended (see comments in above transmit code for more explanation) */
      antennaTimeRxPktEnd =  PAL_BB_TIMER->CC[2]                                        /* start with timer value when payload just finished */
                              + TICKS_PER_USEC * crcTime                              /* add CRC time to arrive at end of packet */
                              + TICKS_PER_USEC * term2Time                            /* add TERM2 time to arrive at end of packet */
                              - TICKS_PER_USEC * NRF5x_PROP_DELAY_RX_USECS;           /* subtract propagation delay to get "antenna time" */

      /* set timer trigger for upcoming TIFS transmit operation */
      PAL_BB_TIMER->CC[0] = antennaTimeRxPktEnd                                         /* start with antenna time */
                            + TICKS_PER_USEC * LL_BLE_TIFS_US                         /* add the TIFS period */
                            - TICKS_PER_USEC * NRF5x_tTXEN_BLE_USECS                  /* subtract ramp-up time */
                            - TICKS_PER_USEC * NRF5x_PROP_DELAY_TX_USECS              /* subtract internal propagation delay */
                            + TICKS_PER_USEC * rxCorrection                             /* empirically derived trim factor (NOTE!! units are ticks, scaler change affects this) */
                            + TICKS_PER_USEC * txCorrection                             /* empirically derived trim factor (NOTE!! units are ticks, scaler change affects this) */
                            + bbTxTifsAdj;                                            /* adjustment specified via API function call */

