ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
      /* configure and enable PPI trigger for TXEN, happens on next timer COMPARE[0] */
      NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_TXEN;  /* configure task */
      NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                  /* enable channel */

      /* an RX is completing, the radio will soon be ramping up for possible TIFS TX */
      tifsState = TIFS_TX_RAMPUP;
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *              RX, set up for TIFS-RX
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else if ((bbOpParam.ifsMode == PAL_BB_IFS_MODE_SAME_ABS) &&
             (driverState == RX_STATE))
    {
      uint32_t preambleTime;
      uint32_t accessAddrTime;
      int32_t correction;

      /* calculate time to receive preamble and access address */
      switch(bbRxPhy)
      {
        case BB_PHY_BLE_1M:
          preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
          accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
          correction = 4;
          break;
        case BB_PHY_BLE_2M:
          preambleTime = LL_BLE_US_PER_BYTE_2M * LL_PREAMBLE_LEN_2M;
          accessAddrTime = LL_BLE_US_PER_BYTE_2M * LL_AA_LEN;
          correction = 20;
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          preambleTime = LL_BLE_US_PER_BIT_CODED_S8 * LL_PREAMBLE_LEN_CODED_BITS;
          accessAddrTime = LL_BLE_US_PER_BYTE_CODED_S8 * LL_AA_LEN;
          correction = 110;
          break;
#endif
        default:
          preambleTime = LL_BLE_US_PER_BYTE_1M * LL_PREAMBLE_LEN_1M;
          accessAddrTime = LL_BLE_US_PER_BYTE_1M * LL_AA_LEN;
          correction = 4;
      }

      PAL_BB_TIMER->CC[0] = BB_US_TO_BB_TICKS(bbOpParam.ifsTime - (NRF5x_tRXEN_BLE_USECS + NRF5x_PROP_DELAY_RX_USECS));

      /* configure and enable PPI trigger for RXEN, happens on next timer COMPARE[0] just configured above */
      NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_RXEN;                        /* configure task */
      NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                                        /* enable channel */

      /* set timer compare CC[1] for RX timeout (allow time to recognize address, and account for propagation delay) */
      PAL_BB_TIMER->CC[1]  = PAL_BB_TIMER->CC[0]
                           + TICKS_PER_USEC * (30       /* TODO Resolve total deviation allowed */
                                               + preambleTime
                                               + accessAddrTime
                                               + NRF5x_PROP_DELAY_RX_USECS
                                               + NRF5x_tRXEN_BLE_USECS
                                               + correction);

      /*
       *  NOTE:  In the case of an RX timeout, the above compare will trigger an interrupt.
       *         This interrupt requires time to execute. This delay extends the time the radio
       *         is active. The effective timeout period is longer than computed above.
       *
       *         This effective timeout period can be reduced using the trim value.
       *         This would be useful for power savings. But be warned!! Great care
       *         is required as this involves timing the speed of code execution.
       *         Any adjustment must be made with debug code disabled.
       */

      /* clear RX timeout compare event, but do not enable interrupt, that happens in radio isr */
      PAL_BB_TIMER->EVENTS_COMPARE[1] = 0;
      WAIT_FOR_WR_BUF_EMPTY(PAL_BB_TIMER->EVENTS_COMPARE[1]);

      /* update channel parameters */
      if (bbOpParam.pIfsChan)
      {
        palBbBleSetChannelParam(bbOpParam.pIfsChan);
      }

      /* a TX is completing, the radio will soon be ramping up for possible TIFS RX */
      tifsState = TIFS_RX_RAMPUP;
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *            TX, set up for TIFS-TX
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else if ((bbOpParam.ifsMode == PAL_BB_IFS_MODE_SAME_ABS) &&
             (driverState == TX_STATE))
    {
      /* calculate start time */
      PAL_BB_TIMER->CC[0] = BB_US_TO_BB_TICKS(bbOpParam.ifsTime - (NRF5x_tTXEN_BLE_USECS + NRF5x_PROP_DELAY_TX_USECS));

      /* configure and enable PPI trigger for TXEN, happens on next timer COMPARE[0] */
      NRF_PPI->CH[14].TEP = (uint32_t) &NRF_RADIO->TASKS_TXEN;  /* configure task */
      NRF_PPI->CHENSET = PPI_CHENSET_CH14_Msk;                  /* enable channel */

      /* update channel parameters */
      if (bbOpParam.pIfsChan)
      {
        palBbBleSetChannelParam(bbOpParam.pIfsChan);
      }

      /* a TX is completing, the radio will soon be ramping up for possible TIFS RX */
      tifsState = TIFS_TX_RAMPUP;
    }

    /* ------------------------------------------------------------------------------
     *  Check to see if TIFS window already missed. This would happen if
     *  interrupts were suppressed for a long time.
     *
     *  NOTE! If the timing for the CC[0] compare is *too early*, it may actually
     *        fire while the radio is still active. If this happens, the operation
     *        that was supposed to trigger is ignored. This will cause big problems
     *        as it cannot be detected. The software assumes the operation is going
     *        forward when it is not. However, this is guarded against when the compare
     *        is set, hence, any problem with this is an internal error.
     */

    /* capture current time */
    PAL_BB_TIMER->TASKS_CAPTURE[3] = 1;

    /* see if current time is already past the TX/RX trigger point */
    if ((PAL_BB_TIMER->CC[0] - PAL_BB_TIMER->CC[3]) & 0x80000000)
    {
      /* disable the PPI channel... which was just enabled */
      NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;  /* COMPARE[0] -> TXEN/RXEN */

      /* override the TIFS state... which was just set */
      tifsState = TIFS_NULL;

      /*
       *  NOTE: If the trigger point were *just* reached, and the RX/TX were actually triggered...
       *        this is OK, the interrupt that fires will be redundant but do no harm.
       */
    }
  }

  /* -----------------------------------------------------------------------------*
   *                       DISABLED  -  "TX-RX Complete"
   * -----------------------------------------------------------------------------*/
  else if ((NRF_RADIO->INTENSET & RADIO_INTENSET_END_Msk) && NRF_RADIO->EVENTS_END)
  {
    /* clear the event, leave the interrupt active */
    NRF_RADIO->EVENTS_END = 0;
    WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_END);

    /* clear diagnostics pins */
    BB_LED_TX_OFF();
    BB_LED_RX_OFF();

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                     TX Complete
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    if (driverState == TX_STATE)
    {
      /* update driver state, *before* callback */
      driverState = IDLE_STATE;
      BB_LED_OFF();

      /* Workaround for TX idle failure in Coded PHY */
      /* TODO: add max attempts */
      while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled)
      {
        /* Workaround for TX idle failure in Coded PHY */
        NRF_RADIO->TASKS_RXEN = 1;

