ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
        /* disable the radio, start early at the top here */
        NRF_RADIO->TASKS_DISABLE = 1;
      }

      /* run callback function */
      palBbRestoreTrl();
      bbTxCallback(BB_STATUS_SUCCESS);
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                     RX Complete
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else if (driverState == RX_STATE)
    {
      uint32_t timestamp;
      uint32_t timestampUsesc;
      int8_t   rssi;

#if defined(NRF52840_XXAA)
      int32_t correction;
#endif

      /* get the PDU payload length from received packet, used later to compute start timestamp */
      uint8_t pduLen = bbpRxBuf[BB_DATA_PDU_LEN_OFFSET];

      if (bbDecryptRxFlag)
      {
        /* disable PPI between RADIO->EVENTS_ADDRESS and CCM->TASKS_CRYPT */
        NRF_PPI->CHENCLR = PPI_CHENSET_CH25_Msk;

        if (pduLen)
        {
          /* shift Rx data to remove NRF CCM RFU byte */
          memcpy(&bbpRxBuf[ENC_RFU_OFFSET], &bbpRxBuf[ENC_RFU_OFFSET+ENC_RFU_LEN], pduLen);
        }
      }

      /*
       *  Calculate the 'start' timestamp.  It is "antenna time" of the first packet bit.
       *
       *  The timestamp is derived from the a previous timer capture (held in CC[4]) that occurred at ADDRESS event.
       *  It calculated by subtracting back from preamble and AA to the packet start.
       *
       *  The PDU payload length was retrieved from the incoming buffer of the last receive packet.
       */
      timestamp = PAL_BB_TIMER->CC[4] - (TICKS_PER_USEC * NRF5x_PROP_DELAY_RX_USECS);
      switch(bbRxPhy)
      {
        case BB_PHY_BLE_1M:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_1M * ( LL_PREAMBLE_LEN_1M +   /* preamble */
                                                                   LL_AA_LEN));           /* address */

#if defined(NRF52840_XXAA)
          timestamp -= (2 * TICKS_PER_USEC);   /* Adjustment based on the sniffer trace observation. */
#endif
          break;
        case BB_PHY_BLE_2M:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_2M * ( LL_PREAMBLE_LEN_2M +   /* preamble */
                                                                   LL_AA_LEN));           /* address */

#if defined(NRF52840_XXAA)
          timestamp += (3 * TICKS_PER_USEC);   /* Adjustment based on the sniffer trace observation. */
#endif
          break;
#if defined(NRF52840_XXAA)
        case BB_PHY_BLE_CODED:
          correction = (bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? 5 : 40;
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BIT_CODED_S8 * ( LL_PREAMBLE_LEN_CODED_BITS +   /* preamble */
                                                                        LL_AA_LEN * 8 ));              /* address */
          timestamp -= TICKS_PER_USEC * correction;                                                    /* Empirical value */

          /* Adjustment based on the sniffer trace observation. */
          timestamp += ((bbRxPhyOptions == BB_PHY_OPTIONS_BLE_S2) ? -29 : -20) * TICKS_PER_USEC;
          break;
#endif
        default:
          timestamp -= (TICKS_PER_USEC * LL_BLE_US_PER_BYTE_1M * ( LL_PREAMBLE_LEN_1M +   /* preamble */
                                                                     LL_AA_LEN));         /* address */
      }

#if (USE_RTC_BB_CLK)
      /* RTC event start time plus timestamp from HFCLK timer.  */
      timestampUsesc = BB_TICKS_TO_US(bbEventStartTime)  + bbDueOffsetUsec + TICKS_TO_USEC(timestamp);
      /* Handle wraparound. */
      if (timestampUsesc > BB_RTC_MAX_VALUE_US)
      {
        timestampUsesc -= BB_RTC_MAX_VALUE_US;
      }
#else
      timestampUsesc = BB_TICKS_TO_US(timestamp);
#endif

      /* compute RSSI value at antenna end */
      rssi = (int8_t)(-(NRF_RADIO->RSSISAMPLE & 0x7F)) - palRadioGetTxRfPathComp();
      /* update driver state, *before* callback */
      driverState = IDLE_STATE;
      BB_LED_OFF();

      /* Follow Rx PHY options */
      bbTxPhyOptions = bbRxPhyOptions;

      /* Overwrite with TIFS preference */
      if (tifsTxPhyOptions)
      {
        bbTxPhyOptions = tifsTxPhyOptions;
      }

      /* see if the CRC failed */
      if ((NRF_RADIO->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk) == RADIO_CRCSTATUS_CRCSTATUS_CRCError)
      {
        /* CRC error - run the callback function */
        bbRxCallback(BB_STATUS_CRC_FAILED, rssi, NRF_RADIO->RXCRC, timestampUsesc, bbRxPhyOptions);
      }
      else if ((bbDecryptRxFlag) && (pduLen) &&
              ((NRF_CCM->MICSTATUS & CCM_MICSTATUS_MICSTATUS_Msk) == CCM_MICSTATUS_MICSTATUS_CheckFailed))
      {
        /* MIC error - run the callback function */
        bbRxCallback(BB_STATUS_MIC_FAILED, rssi, NRF_RADIO->RXCRC, timestampUsesc, bbRxPhyOptions);
      }
      else
      {
        /* Success! - run the callback function */
        bbRxCallback(BB_STATUS_SUCCESS, rssi, NRF_RADIO->RXCRC, timestampUsesc, bbRxPhyOptions);
      }
    }

    /* - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                 Illegal State
     * - - - - - - - - - - - - - - - - - - - - - - - - - */
    else
    {
      BB_ASSERT(0);  /* most likely IDLE state, if not it is completely unknown */

      /*
       *  Ah ah. You tried this, NRF_RADIO->TASKS_DISABLE = 1, didn't you?
       *  Not allowed! Only palBbRadioHardStop() is permitted to do that.
       */
    }
  }

  /* -----------------------------------------------------------------------------*
   *                               Unexpected Interrupt
   * -----------------------------------------------------------------------------*/
  else
  {
    BB_ASSERT(0);
  }
}

/*************************************************************************************************/
/*!
 *  \brief      Cancel TIFS timer.
 *
 *  This stops any active TIFS timer operation. This routine is always called in the callback
 *  (i.e. ISR) context.
 */
/*************************************************************************************************/
void PalBbBleCancelTifs(void)
{
  BB_ASSERT(driverState == IDLE_STATE);  /* driver must be idle */

