ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* hard stop will kill any TIFS ramping up */
  palBbRadioHardStop();
  palBbRestoreTrl();
}

/*************************************************************************************************/
/*!
 *  \brief      Cancel a pending transmit or receive.
 *
 *  This stops any active radio operation. This routine is never called in the callback
 *  (i.e. ISR) context.
 */
/*************************************************************************************************/
void PalBbBleCancelData(void)
{
  BB_ASSERT(driverState != NULL_STATE);  /* driver must be initialized */
  BB_ASSERT(driverState != SLEEP_STATE); /* driver cannot be asleep */

  /* cancel RX timeout if active */
  PAL_BB_TIMER->INTENCLR = TIMER_INTENCLR_COMPARE1_Msk;  /* disable interrupt */
  NVIC_ClearPendingIRQ(PAL_BB_IRQn); /* just in case we are running in interrupt context above TIMER0 */

  /* stop radio */
  palBbRadioHardStop();
  palBbRestoreTrl();

  ///////////////////////////////////////////////////////////////////////////////
  #ifdef DIAGNOSTICS
  diagCancels++;

  /* update diagnostics */
  if (diagOp != DIAG_NULL)
  {
    if ((diagOp == DIAG_TX) || (diagOp == DIAG_TX_TIFS))
    {
      diagTxTotalCalls--;
      if (diagOp == DIAG_TX) { diagTxCalls--; }
      else                   { diagTxTifsCalls--; }
    }
    else if ((diagOp == DIAG_RX) || (diagOp == DIAG_RX_TIFS))
    {
      diagRxTotalCalls--;
      if (diagOp == DIAG_RX) { diagRxCalls--; }
      else                   { diagRxTifsCalls--; }
    }
    else
    {
      BB_ASSERT(0); /* unknown value for diagOp */
    }

    /* finally, set to NULL */
    diagOp = DIAG_NULL;
  }
  #endif
  ///////////////////////////////////////////////////////////////////////////////
}

/*===============================================================================================*/
/*!
 *  \brief      Hard stop of the radio.
 *
 *  \param      None.
 *
 *  Immediately stops the radio. All radio interrupts are cancelled. The radio is put into
 *  the disabled state. This function does not return until the disabled state is verified.
 *
 */
/*===============================================================================================*/
static void palBbRadioHardStop(void)
{
  /* hard stop of all radio interrupts */
  NVIC_DisableIRQ(RADIO_IRQn);

  /* Workaround for TX idle failure in Coded PHY */
  NRF_RADIO->TASKS_RXEN = 1;

  /* disable the radio, start early at the top here */
  NRF_RADIO->TASKS_DISABLE = 1;

  /* disable the PPI channel of TX/RX operations */
  NRF_PPI->CHENCLR = PPI_CHENCLR_CH14_Msk;  /* COMPARE[0] -> TXEN/RXEN */

  /* disable HFCLK */
  PalBbBleLowPower();

  /* update TIFS state */
  tifsState = TIFS_NULL;

  /* update driver state */
  driverState = IDLE_STATE;
  BB_LED_OFF();

  /* clear diagnostics pins */
  BB_LED_TX_OFF();
  BB_LED_RX_OFF();

  /* wait for radio to complete shutdown */
  ///////////////////////////////////////////////////////////////////////////////
  #if BB_ENABLE_ASSERT == TRUE
  uint8_t busycount = 0;
  BB_ASSERT(busycount < 10); /* radio got stuck */
  busycount++;
  #endif
  ///////////////////////////////////////////////////////////////////////////////

#if defined(NRF52840_XXAA)
  /* Restore normal operation for non-Coded PHY. */
  *(volatile uint32_t *)0x4000173C &= ~0x80000000;
#endif

  if (bbDecryptRxFlag)
  {
    /* disable PPI between RADIO->EVENTS_ADDRESS and CCM->TASKS_CRYPT */
    NRF_PPI->CHENCLR = PPI_CHENSET_CH25_Msk;
  }

  /* clear all events */
  NRF_RADIO->EVENTS_READY    = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_READY);
  NRF_RADIO->EVENTS_PAYLOAD  = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_PAYLOAD);
  NRF_RADIO->EVENTS_END = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_END);
  NRF_RADIO->EVENTS_DISABLED = 0;
  WAIT_FOR_WR_BUF_EMPTY(NRF_RADIO->EVENTS_DISABLED);
  /* NOTE: The event ADDRESS is not cleared. There is no associated interrupt.
           It is cleared and set as part of the RX timeout logic. */

  /* stop any encryption that is under way, disable its interrupt */
  NRF_CCM->TASKS_STOP = 1 ;
  NRF_CCM->INTENCLR = CCM_INTENCLR_ENDKSGEN_Msk;

  /* clear any pending radio interrupts */
  NVIC_ClearPendingIRQ(RADIO_IRQn);

  /* re-enable radio interrupts */
  NVIC_EnableIRQ(RADIO_IRQn);
}

/*************************************************************************************************/
/*!
 *  \brief      Get transmit data from transmit descriptor.
 *
 *  \param      descs       Array of transmit buffer descriptor.
 *  \param      cnt         Number of descriptors.
 *
 *  \return     Pointer to transmit data.
 */
/*************************************************************************************************/
static uint8_t *palBbGetTxData(PalBbBleTxBufDesc_t descs[], uint8_t cnt)
{
  uint8_t *pTxBuf;

  if (cnt == 1)
  {
    /* The entire packet is in the 0th buffer. */
    pTxBuf = descs[0].pBuf;
  }
  else
  {
    if (descs[0].len == LL_DATA_HDR_LEN)
    {
      /* Assume Data PDU */

      /* The packet must be gathered into the 1st buffer. */
      pTxBuf = descs[1].pBuf - descs[0].len;

      /* Restore header.  This overwrites data previously transmitted, so it does not need to be preserved. */
      memcpy(pTxBuf, descs[0].pBuf, descs[0].len);

      if (cnt > 2)
      {
        /* The packet has a trailer (i.e., MIC). */
        uint8_t *pTrl = descs[1].pBuf + descs[1].len;
        uint8_t trlLen = descs[2].len;

        /* Preserve overwritten data.  This could be skipped for the last fragment. */
        memcpy(bbTrlSave, pTrl, trlLen);
        bbTrlSavedLen = trlLen;
        bbTrlSavedPtr = pTrl;

        /* Restore trailer. */
        memcpy(pTrl, descs[2].pBuf, trlLen);
      }
    }
    else
    {
      static uint8_t contTxBuf[LL_EXT_ADVB_MAX_LEN];

      /* Assume Extended advertising PDU */
      BB_ASSERT(descs[0].len >= (LL_ADV_HDR_LEN + LL_EXT_ADV_HDR_MIN_LEN));
      BB_ASSERT((descs[0].len + descs[1].len) <= sizeof(contTxBuf));

      pTxBuf = contTxBuf;
      memcpy(contTxBuf, descs[0].pBuf, descs[0].len);
      memcpy(contTxBuf + descs[0].len, descs[1].pBuf, descs[1].len);
    }
  }

  return pTxBuf;
}

/*************************************************************************************************/
/*!
 *  \brief      Restore trailer data.
 *
 */
/*************************************************************************************************/
static void palBbRestoreTrl(void)
{
  if (bbTrlSavedPtr != NULL)
  {
    memcpy(bbTrlSavedPtr, bbTrlSave, bbTrlSavedLen);
    bbTrlSavedPtr = NULL;
  }
}

///////////////////////////////////////////////////////////////////////////////
#ifdef DIAGNOSTICS
/*===============================================================================================*/
/*!
 *  \brief      Diagnostic function to record callback status.
 *
 *  \param      status      status as reported via callback
 *
 *  For diagnostics, this function is used to intercept passing control to the configured
 *  callback function. It is used to record diagnostic information.
 *
 */
/*===============================================================================================*/
static void DiagFauxTxCallback(uint8_t status)
{
  BB_ASSERT(diagOp != DIAG_NULL); /* more than one callback for the operation? */
  BB_ASSERT((diagOp == DIAG_TX) || (diagOp == DIAG_TX_TIFS)); /* apparent criss-cross of tx/rx, typo somewhere? */

