ARMmbed/mbed-os/connectivity/drivers/ble/FEATURE_BLE/TARGET_NORDIC/TARGET_NORDIC_CORDIO/TARGET_NRF5x/stack/sources/pal_bb_ble.c
  /* keep account of each operation-result */
  if (diagOp == DIAG_TX)
  {
    if      (status == BB_STATUS_SUCCESS)  { diagTxSuccess++; }
    else if (status == BB_STATUS_FAILED)   { diagTxFail++;    }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else if (diagOp == DIAG_TX_TIFS)
  {
    if      (status == BB_STATUS_SUCCESS)  { diagTxTifsSuccess++; }
    else if (status == BB_STATUS_FAILED)   { diagTxTifsFail++;    }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else
  {
    BB_ASSERT(0); /* unexpected operation */
  }

  /* extra integrity checks, make sure the accounting adds up */
  BB_ASSERT(diagTxTotalCalls == (uint16_t)(diagTxSuccess + diagTxFail + diagTxTifsSuccess + diagTxTifsFail));
  BB_ASSERT(diagTxCalls      == (uint16_t)(diagTxSuccess + diagTxFail));
  BB_ASSERT(diagTxTifsCalls  == (uint16_t)(diagTxTifsSuccess + diagTxTifsFail));

  BB_ASSERT(diagTxFail       == (uint16_t)(diagTxFailBadDueTime + diagTxFailMissedDueTime));
  BB_ASSERT(diagTxTifsFail   == (uint16_t)(diagTxTifsFailMissed + diagTxTifsFailNotPossible));

  /* keep track of last operation */
  diagOpLast = diagOp;
  diagOp = DIAG_NULL;
  diagLastStatus = status;

  /* finally, run the user specified callback, everything else is just diagnostics */
  diagTxCallback(status);
}

/*===============================================================================================*/
/*!
 *  \brief      Diagnostic function to record callback status.
 *
 *  \param      status      status as reported via callback
 *
 *  For diagnostics, this function is used to intercept passing control to the configured
 *  callback function. It is used to record diagnostic information.
 *
 */
/*===============================================================================================*/
static void DiagFauxRxCallback(uint8_t status, int8_t rssi, uint32_t crc, uint32_t timestamp)
{
  BB_ASSERT(diagOp != DIAG_NULL); /* more than one callback for the operation? */
  BB_ASSERT((diagOp == DIAG_RX) || (diagOp == DIAG_RX_TIFS)); /* apparent criss-cross of tx/rx, typo somewhere? */

  /* keep account of each operation-result */
  if (diagOp == DIAG_RX)
  {
    if      (status == BB_STATUS_SUCCESS)           { diagRxSuccess++; }
    else if (status == BB_STATUS_FAILED)            { diagRxFail++; }
    else if (status == BB_STATUS_RX_TIMEOUT)        { diagRxTimeout++; }
    else if (status == BB_STATUS_CRC_FAILED)        { diagRxCrcFail++; }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else if (diagOp == DIAG_RX_TIFS)
  {
    if      (status == BB_STATUS_SUCCESS)           { diagRxTifsSuccess++; }
    else if (status == BB_STATUS_FAILED)            { diagRxTifsFail++; }
    else if (status == BB_STATUS_RX_TIMEOUT)        { diagRxTifsTimeout++; }
    else if (status == BB_STATUS_CRC_FAILED)        { diagRxTifsCrcFail++; }
    else { BB_ASSERT(0); } /* unexpected status for the operation */
  }
  else
  {
    BB_ASSERT(0); /* unexpected operation */
  }

  /* extra integrity check, make sure the accounting adds up */
  BB_ASSERT(diagRxTotalCalls  == (uint16_t)( diagRxSuccess +
                                              diagRxFail +
                                              diagRxTimeout +
                                              diagRxCrcFail +
                                              diagRxTifsSuccess +
                                              diagRxTifsFail +
                                              diagRxTifsTimeout +
                                              diagRxTifsCrcFail ));

  BB_ASSERT(diagRxCalls       == (uint16_t)( diagRxSuccess +
                                              diagRxFail +
                                              diagRxTimeout +
                                              diagRxCrcFail ));

  BB_ASSERT(diagRxTifsCalls   == (uint16_t)( diagRxTifsSuccess +
                                              diagRxTifsFail +
                                              diagRxTifsTimeout +
                                              diagRxTifsCrcFail ));

  BB_ASSERT(diagRxFail     == (uint16_t)(diagRxFailBadDueTime + diagRxFailMissedDueTime));
  BB_ASSERT(diagRxTifsFail == (uint16_t)(diagRxTifsFailMissed + diagRxTifsFailNotPossible));

  /* keep track of last operation */
  diagOpLast = diagOp;
  diagOp = DIAG_NULL;
  diagLastStatus = status;

  /* finally, run the user specified callback, everything else is just diagnostics */
  diagRxCallback(status, rssi, crc, timestamp);
}
#endif

/////////////////////////////////////////////////////////////////////////////////
